{"questions": [{"question": "Give me all launch pads operated by NASA.", "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }", "triples": ["<http://dbpedia.org/resource/A._Stephen_Morse> <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/NASA>", "<http://dbpedia.org/resource/NASA> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatGovernmentAgenciesEstablishedIn1958>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Bill_Nelson>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Ariane_5>", "<http://dbpedia.org/resource/NASA> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Government_agencies_established_in_1958>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/title> \"Articles and topics related to NASA\"@en", "<http://dbpedia.org/resource/NASA> <http://www.w3.org/2000/01/rdf-schema#label> \"NASA\"@en", "<http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>", "<http://dbpedia.org/resource/Louisiana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Baton_Rouge,_Louisiana>", "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/state> \"collapsed\"@en", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/name> \"National Aeronautics and Space Administration\"@en", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/jurisdiction> <http://dbpedia.org/resource/Federal_government_of_the_United_States>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/leaderTitle> <http://dbpedia.org/resource/List_of_administrators_and_deputy_administrators_of_NASA>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/motto> \"For the Benefit of All\"@en", "<http://dbpedia.org/resource/Washington,_D.C.> <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Eastern_Time_Zone>"]}, {"question": "List all boardgames by GMT.", "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }", "triples": ["<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsEvent>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Irish_Statute_Book>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Greenwich Mean Time\"@en", "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>", "<http://dbpedia.org/resource/Sahrawi_Arab_Democratic_Republic> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tifariti>", "<http://dbpedia.org/resource/Portugal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>", "<http://dbpedia.org/resource/Ghana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>", "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/De_facto>", "<http://dbpedia.org/resource/Ivory_Coast> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yamoussoukro>", "<http://dbpedia.org/resource/Mauritania> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nouakchott>", "<http://dbpedia.org/resource/Burkina_Faso> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ouagadougou>", "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>", "<http://dbpedia.org/resource/Togo> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lom\u00e9>", "<http://dbpedia.org/resource/Senegal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dakar>", "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>", "<http://dbpedia.org/resource/Liberia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Monrovia>", "<http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ottawa>", "<http://dbpedia.org/resource/Guinea-Bissau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bissau>", "<http://dbpedia.org/resource/The_Gambia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Banjul>", "<http://dbpedia.org/resource/Guinea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Conakry>", "<http://dbpedia.org/resource/Republic_of_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dublin>", "<http://dbpedia.org/resource/Mali> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bamako>", "<http://dbpedia.org/resource/Sierra_Leone> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Freetown>"]}, {"question": "Give me the grandchildren of Bruce Lee.", "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child dbp:children ?uri }", "triples": ["<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Brandon_Lee>", "<http://dbpedia.org/resource/Lee_Hoi-chuen> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Bruce_Lee>", "<http://dbpedia.org/resource/Bruce_Lee> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatAmericanFilmDirectors>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/San_Francisco>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Linda_Lee_Cadwell>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/British_Hong_Kong>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Martial_arts>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/University_of_Washington>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Category:People_from_Chinatown,_San_Francisco>", "<http://dbpedia.org/resource/Bruce_Lee> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:20th-century_American_male_writers>", "<http://dbpedia.org/resource/Bruce_Lee> <http://www.w3.org/2000/01/rdf-schema#label> \"Bruce Lee\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/children> \"Brandon and Shannon Lee\"@en", "<http://dbpedia.org/resource/Linda_Lee_Cadwell> <http://www.w3.org/2000/01/rdf-schema#label> \"Linda Lee Cadwell\"@en", "<http://dbpedia.org/resource/Shannon_Lee> <http://dbpedia.org/property/spouse> \"Ian Keasler\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Cerebral_edema>", "<http://dbpedia.org/resource/Switzerland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/De_jure>", "<http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Beijing>", "<http://dbpedia.org/resource/British_Hong_Kong> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Victoria,_Hong_Kong>", "<http://dbpedia.org/resource/Minnesota> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Saint_Paul,_Minnesota>", "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/New_Delhi>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/date> \"January 2022\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/birthName> \"Lee Jun-fan\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/birthName> \")\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Lake_View_Cemetery_(Seattle)>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/birthPlace> \"San Francisco, California, U.S.\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/alias> \"Bruce Lee Siu-lung, Lee Yuen-cham, Lee Yuen-kam\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/British_Hong_Kong>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/University_of_Washington>", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/spouse> \"\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/name> \"Bruce Lee\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/restingPlace> \"Lake View Cemetery, Seattle, Washington, U.S.\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/mother> \"Grace Ho\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/occupation> \"director\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/species> \"no\"@en", "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/deathCause> <http://dbpedia.org/resource/Cerebral_edema>", "<http://dbpedia.org/resource/San_Francisco> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>", "<http://dbpedia.org/resource/University_of_Washington> <http://dbpedia.org/property/mascot> \"\"@en", "<http://dbpedia.org/resource/University_of_Washington> <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Washington_(state)>"]}, {"question": "List all games by GMT.", "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }", "triples": ["<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsEvent>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Irish_Statute_Book>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>", "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Greenwich Mean Time\"@en", "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>", "<http://dbpedia.org/resource/Sahrawi_Arab_Democratic_Republic> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tifariti>", "<http://dbpedia.org/resource/Portugal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>", "<http://dbpedia.org/resource/Ghana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>", "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/De_facto>", "<http://dbpedia.org/resource/Ivory_Coast> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yamoussoukro>", "<http://dbpedia.org/resource/Mauritania> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nouakchott>", "<http://dbpedia.org/resource/Burkina_Faso> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ouagadougou>", "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>", "<http://dbpedia.org/resource/Togo> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lom\u00e9>", "<http://dbpedia.org/resource/Senegal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dakar>", "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>", "<http://dbpedia.org/resource/Liberia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Monrovia>", "<http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ottawa>", "<http://dbpedia.org/resource/Guinea-Bissau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bissau>", "<http://dbpedia.org/resource/The_Gambia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Banjul>", "<http://dbpedia.org/resource/Guinea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Conakry>", "<http://dbpedia.org/resource/Republic_of_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dublin>", "<http://dbpedia.org/resource/Mali> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bamako>", "<http://dbpedia.org/resource/Sierra_Leone> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Freetown>"]}, {"question": "Give me the Apollo 14 astronauts.", "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }", "triples": ["<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#Event>", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/List_of_Apollo_missions>", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/File:Apollo_14_golf.jpg>", "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Stuart_Roosa>", "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/2000/01/rdf-schema#label> \"Apollo 14\"@en", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Apollo_program>", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Rockwell_International>", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/name> \"Apollo 14\"@en", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/manufacturer> \"LM: Grumman\"@en", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Command Module Pilot\"@en", "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/NASA>", "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>"]}, {"question": "Give me all writers that won the Nobel Prize in literature.", "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }", "triples": ["<http://dbpedia.org/resource/William_Golding__William_Golding__1> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature>", "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Bill_Bottrell>"]}, {"question": "Give me all books written by Danielle Steel.", "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }", "triples": ["<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Bill_Bottrell>", "<http://dbpedia.org/resource/Danielle_Steel's_A_Perfect_Stranger> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Danielle_Steel>", "<http://dbpedia.org/resource/Danielle_Steel> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.wikidata.org/entity/Q5>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/New_York_City>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/New_York_University>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Thomas_Perkins_(businessman)>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Nick_Traina>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Romance_novel>", "<http://dbpedia.org/resource/Danielle_Steel> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:20th-century_American_novelists>", "<http://dbpedia.org/resource/Danielle_Steel> <http://www.w3.org/2000/01/rdf-schema#label> \"Danielle Steel\"@en", "<http://dbpedia.org/resource/France> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Paris>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/birthName> \"Danielle Fernandes Dominique Schuelein-Steel\"@en", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/birthName> \"Danielle Fernandes Dominique Schuelein-Steel\"@en", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/birthPlace> \"New York, New York, U.S.\"@en", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/New_York_University>", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/genre> \"Contemporary\"@en", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/name> \"Danielle Steel\"@en", "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/occupation> \"Novelist\"@en", "<http://dbpedia.org/resource/New_York_City> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>", "<http://dbpedia.org/resource/New_York_University> <http://dbpedia.org/property/mascot> \"Bobcat\"@en"]}]}