{
  "questions": [
    {
      "question": "Who created Batman?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Batman_(Earth-Two)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman_(Terry_McGinnis)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bob_Kane>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bob_Kane>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>",
        "<http://dbpedia.org/resource/Batman:_The_Dark_Knight_(video_game)> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Skylab_VIII_(album)> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/title> \"Articles and topics related to Batman\"@en",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/state> \"collapsed\"@en",
        "<http://dbpedia.org/resource/Skylab_VIII_(album)> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/DC_Comics>",
        "<http://dbpedia.org/resource/Batman_(Earth-Two)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman_(Terry_McGinnis)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Batman>"
      ]
    },
    {
      "question": "Give me all video games published by Mean Hamster Software.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
      "triples": [
        "<http://dbpedia.org/resource/Riven> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/foundingYear> \"1985\"^^<http://www.w3.org/2001/XMLSchema#gYear>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Deer_Park,_Washington>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/numberOfEmployees> \"14\"^^<http://www.w3.org/2001/XMLSchema#nonNegativeInteger>",
        "<http://dbpedia.org/resource/Riven> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software>",
        "<http://dbpedia.org/resource/John_Swiderski> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Mean_Hamster_Software>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/John_Swiderski>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Deer_Park,_Washington>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/keyPeople> \"John Swiderski, CEO and founder\"@en",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Privately_held_company>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Deer_Park,_Washington>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/products> \"Cat Wash, Passport to Perfume, Ye Olde Sandwich Shoppe, Everything Nice, Myst, Riven, Pet Shop Hop, Vegas Nights and Exidy games\"@en",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/property/foundation> \"1985\"^^<http://www.w3.org/2001/XMLSchema#integer>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Privately_held_company>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/John_Swiderski>",
        "<http://dbpedia.org/resource/John_Swiderski> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Mean_Hamster_Software>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Riven>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Exidy>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Myst>"
      ]
    },
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Walter_H._F._Smith>",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/P\u00e5l_Wessel>",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Walter_H._F._Smith>",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/P\u00e5l_Wessel>",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/property/developer> \"Wessel, Smith and volunteers\"@en",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/property/author> \"Paul Wessel and Walter H. F. Smith\"@en",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/GNU_Lesser_General_Public_License>",
        "<http://dbpedia.org/resource/Generic_Mapping_Tools> <http://dbpedia.org/property/genre> \"Map generator\"@en"
      ]
    },
    {
      "question": "Show me all books in Asimov's Foundation series.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "triples": [
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> <Foundation>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> <Prelude to Foundation>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> <>",
        "<http://dbpedia.org/resource/Foundation_(Asimov_novel)> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Edge> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Chaos> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/title> \"Foundation series\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Isaac_Asimov>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/language> \"English\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/country> \"United States\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/publisher> \"Astounding Magazine, Gnome Press, Spectra, Doubleday\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction>"
      ]
    },
    {
      "question": "Is Cola a beverage?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "triples": [
        "<http://dbpedia.org/resource/Virgin_Drinks> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/United_States>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/manufacturer> \"Various\"@en"
      ]
    },
    {
      "question": "Give me all Seven Wonders of the Ancient World.",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }",
      "triples": [
        "<http://dbpedia.org/resource/Seven_Wonders_of_the_Ancient_World> <http://dbpedia.org/property/label> \"Seven Wonders of the Ancient World\"@en"
      ]
    },
    {
      "question": "Give me the runtime of Toy Story.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "triples": [
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> <4860.0>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/budget> \"3.0E7\"^^<http://dbpedia.org/datatype/usDollar>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Randy_Newman>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Annie_Potts>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/John_Morris_(actor)>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Don_Rickles>",
        "<http://dbpedia.org/resource/How_It_Should_Have_Ended> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Toy_Story>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/starring> \"Don Rickles\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/John_Lasseter>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Joel_Cohen_(writer)>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/starring> \"Tom Hanks\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/title> \"Toy Story\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/starring> \"Erik von Detten\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/List_of_Pixar_awards_and_nominations_(feature_films)>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Joss_Whedon>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Ralph_Guggenheim>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Bonnie_Arnold>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/language> \"English\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Walt_Disney_Studios_Motion_Pictures>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/country> \"United States\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Buena_Vista_Pictures_Distribution>",
        "<http://dbpedia.org/resource/How_It_Should_Have_Ended> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Toy_Story>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Annie_Potts>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/producer> \"Ralph Guggenheim\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Randy_Newman>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/producer> \"\"@en",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/John_Lasseter>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/John_Morris_(actor)>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Don_Rickles>",
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/producer> \"Bonnie Arnold\"@en"
      ]
    }
  ]
}
