{
  "questions": [
    {
      "question": "List all the musicals with music by Elton John.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
      "triples": [
        "<http://dbpedia.org/resource/Billy_Elliot_the_Musical> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/The_Lion_King_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Lestat_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Aida_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/Lestat_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/Billy_Elliot_the_Musical> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/Aida_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/The_Lion_King_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>"
      ]
    },
    {
      "question": "Give me all actors starring in movies directed by William Shatner.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/DeForest_Kelley>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Dan_Gauthier>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Duane_Whitaker>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonard_Nimoy>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Nichelle_Nichols>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Amy_Acker>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Laurence_Luckinbill>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/George_Takei>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Rickey_Medlocke>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Towles>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/James_Doohan>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Chuck_Williams_(actor)>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Brenda_Bakke>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/J.T._Colosa>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Walter_Koenig>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Dick_Van_Patten>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Dan_Martin_(actor)>",
        "<http://dbpedia.org/resource/Groom_Lake_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/John_Prosky>"
      ]
    },
    {
      "question": "Give me all launch pads operated by NASA.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
      "triples": [
        "<http://dbpedia.org/resource/Keweenaw_Rocket_Range> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Broglio_Space_Center> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39A> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_18> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_45> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39B> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_13> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_36> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Space_Launch_Complex_17> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_47> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Broglio_Space_Center> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_48> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_36> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_48> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_45> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_18> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Keweenaw_Rocket_Range> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Space_Launch_Complex_17> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39A> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_47> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_13> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39B> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>"
      ]
    },
    {
      "question": "Who created Batman?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bob_Kane>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>"
      ]
    },
    {
      "question": "Give me all video games published by Mean Hamster Software.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
      "triples": [
        "<http://dbpedia.org/resource/Riven> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>",
        "<http://dbpedia.org/resource/Riven> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software>"
      ]
    },
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Fields_of_Fire_(game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Labyrinth:_The_War_on_Terror,_2001_\u2013_%3F> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Washington's_War> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Commands_&_Colors:_Ancients> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Paths_of_Glory_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Twilight_Struggle> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Chandragupta_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Sword_of_Rome> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>"
      ]
    },
    {
      "question": "Give me all actors starring in Last Action Hero.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Arnold_Schwarzenegger>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Austin_O'Brien>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Art_Carney>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Frank_McRae>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Anthony_Quinn>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Noonan>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Robert_Prosky>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/F._Murray_Abraham>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mercedes_Ruehl>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Charles_Dance>"
      ]
    },
    {
      "question": "Give me all British oceanographers.",
      "query": "PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbp:field res:Oceanography ; dbo:birthPlace res:United_Kingdom }",
      "triples": [
        "<http://dbpedia.org/resource/Peter_Clift> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom>",
        "<http://dbpedia.org/resource/Peter_Clift> <http://dbpedia.org/property/field> <http://dbpedia.org/resource/Oceanography>"
      ]
    },
    {
      "question": "Show me Hemingway's autobiography.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
      "triples": [
        "<http://dbpedia.org/resource/A_Moveable_Feast> <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Autobiography>",
        "<http://dbpedia.org/resource/A_Moveable_Feast> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Ernest_Hemingway>"
      ]
    },
    {
      "question": "Give me all books by William Goldman with more than 300 pages.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
      "triples": [
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"342\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Control_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"309\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Control_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"493\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://dbpedia.org/ontology/numberOfPages> \"306\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://dbpedia.org/ontology/numberOfPages> \"355\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://dbpedia.org/ontology/numberOfPages> \"623\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Control_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"305\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://dbpedia.org/ontology/numberOfPages> \"485\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://dbpedia.org/ontology/numberOfPages> \"363\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://dbpedia.org/ontology/numberOfPages> \"310\"^^<http://www.w3.org/2001/XMLSchema#positiveInteger>",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>"
      ]
    },
    {
      "question": "Show me all books in Asimov's Foundation series.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "triples": [
        "<http://dbpedia.org/resource/Foundation_and_Chaos> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Fear> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Edge> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Earth> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Prelude_to_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_(Asimov_novel)> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/The_Originist> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Triumph> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Second_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/R._Daneel_Olivaw> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Empire> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Forward_the_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>"
      ]
    },
    {
      "question": "Give me all members of Prodigy.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Maxim_(musician)>",
        "<http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Liam_Howlett>"
      ]
    },
    {
      "question": "Give me all Seven Wonders of the Ancient World.",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }",
      "triples": [
        "<http://dbpedia.org/resource/Mausoleum_at_Halicarnassus> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Lighthouse_of_Alexandria> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Temple_of_Artemis> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Colossus_of_Rhodes> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Statue_of_Zeus_at_Olympia> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Hanging_Gardens_of_Babylon> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Seven_Wonders_of_the_Ancient_World> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>",
        "<http://dbpedia.org/resource/Great_Pyramid_of_Giza> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Seven_Wonders_of_the_Ancient_World>"
      ]
    },
    {
      "question": "Who killed Caesar?",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT DISTINCT ?uri WHERE { ?uri dct:subject dbc:Assassins_of_Julius_Caesar }",
      "triples": [
        "<http://dbpedia.org/resource/Marcus_Junius_Brutus> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Gaius_Cassius_Parmensis> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Gaius_Cassius_Longinus> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Lucius_Minucius_Basilus> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Marcus_Porcius_Cato_(son_of_Cato_the_Younger)> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Publius_Servilius_Casca> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Gaius_Trebonius> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Pacuvius_Labeo> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Tillius_Cimber> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Decimus_Junius_Brutus_Albinus> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>",
        "<http://dbpedia.org/resource/Pontius_Aquila> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Assassins_of_Julius_Caesar>"
      ]
    },
    {
      "question": "Give me the runtime of Toy Story.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "triples": [
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> \"4860.0\"^^<http://www.w3.org/2001/XMLSchema#double>"
      ]
    }
  ]
}
