SearchResults:
UpdatedPropertyDetails:
a:
aapi:
activity:
address:
admin:
amz:
atom:
audio:
awol:
batch:
bestbuy:
bibo:
bif:
book:
bookmark:
bugzilla:
buzz:
c:
category-de:
cc:
cert:
cl:
cnet:
content:
cp:
crosspost:
cv:
cvbase:
d:
dawgt:
dbc:
dbo:
dbp:
dbpedia-af:
dbpedia-als:
dbpedia-an:
dbpedia-ar:
dbpedia-az:
dbpedia-bar:
dbpedia-be:
dbpedia-be-x-old:
dbpedia-bg:
dbpedia-br:
dbpedia-ca:
dbpedia-commons:
dbpedia-cs:
dbpedia-cy:
dbpedia-da:
dbpedia-de:
dbpedia-dsb:
dbpedia-el:
dbpedia-eo:
dbpedia-es:
dbpedia-et:
dbpedia-eu:
dbpedia-fa:
dbpedia-fi:
dbpedia-fr:
dbpedia-frr:
dbpedia-fy:
dbpedia-ga:
dbpedia-gd:
dbpedia-gl:
dbpedia-he:
dbpedia-hr:
dbpedia-hsb:
dbpedia-hu:
dbpedia-id:
dbpedia-ie:
dbpedia-io:
dbpedia-is:
dbpedia-it:
dbpedia-ja:
dbpedia-ka:
dbpedia-kk:
dbpedia-ko:
dbpedia-ku:
dbpedia-la:
dbpedia-lb:
dbpedia-lmo:
dbpedia-lt:
dbpedia-lv:
dbpedia-mk:
dbpedia-mr:
dbpedia-ms:
dbpedia-nah:
dbpedia-nds:
dbpedia-nl:
dbpedia-nn:
dbpedia-no:
dbpedia-nov:
dbpedia-oc:
dbpedia-os:
dbpedia-pam:
dbpedia-pl:
dbpedia-pms:
dbpedia-pnb:
dbpedia-pt:
dbpedia-ro:
dbpedia-ru:
dbpedia-sh:
dbpedia-simple:
dbpedia-sk:
dbpedia-sl:
dbpedia-sq:
dbpedia-sr:
dbpedia-sv:
dbpedia-sw:
dbpedia-th:
dbpedia-tr:
dbpedia-ug:
dbpedia-uk:
dbpedia-vi:
dbpedia-vo:
dbpedia-war:
dbpedia-wikicompany:
dbpedia-wikidata:
dbpedia-yo:
dbpedia-zh:
dbpedia-zh-min-nan:
dbr:
dbt:
dc:
dcmitype:
dct:
digg:
dul:
dv:
dwc:
ebay:
enc:
ep:
etsy:
event:
evri:
exif:
fb:
ff:
fn:
foaf:
freebase:
g:
gb:
gbs:
gd:
geo:
geodata:
geonames:
georss:
geospecies:
gm:
gml:
go:
gphoto:
gr:
gs:
guardian:
hlisting:
hnews:
hrev:
http-voc:
ical:
ir:
itunes:
ldp:
lfm:
lgdt:
like:
m:
math:
md:
media:
mesh:
meta:
mf:
mmd:
mo:
moat:
mql:
nci:
nfo:
ng:
nyt:
o:
oai:
oai_dc:
obo:
office:
og:
ogc:
ogcgml:
ogcgs:
ogcgsf:
ogcgsr:
ogcsf:
oo:
openSearch:
opencyc:
openstreetmap:
opl:
opl-gs:
opl-meetup:
opl-xbrl:
oplamz:
oplangel:
oplbase:
oplbb:
oplcb:
oplcert:
oplcn:
oplcv:
oplebay:
oplevri:
oplfq:
oplgp:
oplgw:
oplhp:
opljg:
oplklout:
oplli:
oplmny:
oplnyt:
oplog:
oplseevl:
oplsg:
oplso:
opltesco:
opltw:
oplustream:
oplweb:
oplzllw:
ore:
owl:
p:
plancast:
po:
poco:
product:
prop-de:
protseq:
prov:
proxy:
pto:
pw:
r:
radio:
rdf:
rdfa:
rdfdf:
rdfs:
review:
rnews:
rss:
s:
sc:
schema:
scot:
scovo:
sd:
sf:
sioc:
sioct:
skos:
slash:
sql:
ss:
stock:
tag:
taxconcept:
template-de:
thr:
time:
tio:
tl:
twfy:
twitter:
uClassify:
umbel:
umbel-ac:
umbel-rc:
umbel-sc:
units:
v:
vcard:
vcard2006:
vi:
video:
vimeo:
virt:
virtcxml:
virtrdf:
virtrdfmec:
void:
vt:
w:
wa:
wdrs:
wf:
wfw:
wiki-commons:
wikidata:
wikipedia-de:
xf:
xfn:
xfnv:
xhtml:
xhv:
xml:
xn:
xsd:
xsi:
xsl10:
xsl1999:
xslwd:
y:
yago:
yago-res:
yt:
zillow:
