{
  "questions": [
    {
      "question": "List all the musicals with music by Leonard Bernstein.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
      "triples": [
        "<http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatBisexualMen>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Lawrence,_Massachusetts>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Felicia_Montealegre>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Manhattan>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Conducting>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Harvard_University>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Suite_(music)>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Jewish_American_philanthropists>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://www.w3.org/2000/01/rdf-schema#label> \"Leonard Bernstein\"@en",
        "<http://dbpedia.org/resource/Felicia_Montealegre> <http://www.w3.org/2000/01/rdf-schema#label> \"Felicia Montealegre\"@en",
        "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/birthName> \"Louis Bernstein\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/birthName> \"Louis Bernstein\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Green-Wood_Cemetery>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/birthPlace> \"Lawrence, Massachusetts, U.S.\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/deathPlace> \"Manhattan, New York City, U.S.\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/almaMater> \"Harvard University\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/spouse> \"\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/name> \"Leonard Bernstein\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/restingPlace> \"Green-Wood Cemetery, Brooklyn, New York City, U.S.\"@en",
        "<http://dbpedia.org/resource/Leonard_Bernstein> <http://dbpedia.org/property/occupation> \"Conductor\"@en",
        "<http://dbpedia.org/resource/Lawrence,_Massachusetts> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>",
        "<http://dbpedia.org/resource/Harvard_University> <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Massachusetts>",
        "<http://dbpedia.org/resource/Harvard_University> <http://dbpedia.org/property/mascot> \"John Harvard\"@en"
      ]
    },
    {
      "question": "Give me all types of eating disorders.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
      "triples": [
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/type> \"single\"@en",
        "<http://dbpedia.org/resource/Eating_disorder> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://umbel.org/umbel/rc/AilmentCondition>",
        "<http://dbpedia.org/resource/Eating_disorder> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Tic_disorder>",
        "<http://dbpedia.org/resource/Eating_disorder> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Eating_disorders>",
        "<http://dbpedia.org/resource/Eating_disorder> <http://www.w3.org/2000/01/rdf-schema#label> \"Eating disorder\"@en",
        "<http://dbpedia.org/resource/France> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Paris>",
        "<http://dbpedia.org/resource/Eating_disorder> <http://dbpedia.org/property/field> <http://dbpedia.org/resource/Psychiatry>",
        "<http://dbpedia.org/resource/Eating_disorder> <http://dbpedia.org/property/name> \"Eating disorders\"@en"
      ]
    },
    {
      "question": "Give me all books written by Danielle Steel.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
      "triples": [
        "<http://dbpedia.org/resource/The_Promise_(1979_film)> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Danielle_Steel>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Bill_Bottrell>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Wikicat21st-centuryAmericanNovelists>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/New_York_City>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/New_York_University>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Category:Writers_from_San_Francisco>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Nick_Traina>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Romance_novel>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:21st-century_American_novelists>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://www.w3.org/2000/01/rdf-schema#label> \"Danielle Steel\"@en",
        "<http://dbpedia.org/resource/France> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Paris>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/birthName> \"Danielle Fernandes Dominique Schuelein-Steel\"@en",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/ontology/birthName> \"Danielle Fernandes Dominique Schuelein-Steel\"@en",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/birthPlace> \"New York, New York, U.S.\"@en",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/New_York_University>",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/genre> \"Contemporary\"@en",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/name> \"Danielle Steel\"@en",
        "<http://dbpedia.org/resource/Danielle_Steel> <http://dbpedia.org/property/occupation> \"Novelist\"@en",
        "<http://dbpedia.org/resource/New_York_University> <http://dbpedia.org/property/mascot> \"Bobcat\"@en"
      ]
    },
    {
      "question": "Give me all B-sides of the Ramones.",
      "query": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
      "triples": []
    },
    {
      "question": "Give me all Methodist politicians.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
      "triples": [
        "<http://dbpedia.org/resource/Methodism> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/NongovernmentalOrganization108009834>",
        "<http://dbpedia.org/resource/Methodism> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Sola_gratia>",
        "<http://dbpedia.org/resource/Methodism> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Methodism>",
        "<http://dbpedia.org/resource/Methodism> <http://dbpedia.org/property/title> \"A traditional summary of Methodist teaching\"@en",
        "<http://dbpedia.org/resource/Methodism> <http://www.w3.org/2000/01/rdf-schema#label> \"Methodism\"@en",
        "<http://dbpedia.org/resource/Papal_States> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/New_York_(state)> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Albany,_New_York>",
        "<http://dbpedia.org/resource/North_Carolina> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Raleigh,_North_Carolina>",
        "<http://dbpedia.org/resource/Samoa> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Apia>",
        "<http://dbpedia.org/resource/Province_of_Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Quebec_City>",
        "<http://dbpedia.org/resource/New_Jersey> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Trenton,_New_Jersey>",
        "<http://dbpedia.org/resource/Province_of_Georgia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Savannah,_Georgia>",
        "<http://dbpedia.org/resource/Lower_Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Quebec_City>",
        "<http://dbpedia.org/resource/Tonga> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nuku\u02bbalofa>",
        "<http://dbpedia.org/resource/Gold_Coast_(British_colony)> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>",
        "<http://dbpedia.org/resource/Fiji> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Suva>",
        "<http://dbpedia.org/resource/Upper_Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/York,_Upper_Canada>"
      ]
    },
    {
      "question": "Give me all actors called Baldwin.",
      "query": "PREFIX foaf: <http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?uri WHERE { ?uri foaf:surname \"Baldwin\"@en { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> } UNION { ?uri a <http://dbpedia.org/ontology/Actor> } }",
      "triples": [
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Institution108053576>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Eddystone,_Pennsylvania>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Colorado>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Rail_transport>",
        "<http://dbpedia.org/resource/Eddystone,_Pennsylvania> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Borough108540532>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/foundation> \"Philadelphia, U.S.\"@en",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Former_components_of_the_Dow_Jones_Industrial_Average>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/location> \"Eddystone, Pennsylvania, U.S.\"@en",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/successor> \"Baldwin-Lima-Hamilton Corporation\"@en",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://www.w3.org/2000/01/rdf-schema#label> \"Baldwin Locomotive Works\"@en",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Locomotive>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Rail_transport>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Matthias_W._Baldwin>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Locomotive>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Matthias_W._Baldwin>",
        "<http://dbpedia.org/resource/Baldwin_Locomotive_Works> <http://dbpedia.org/property/name> \"Baldwin Locomotive Works\"@en"
      ]
    },
    {
      "question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Bruce_Springsteen> . ?uri <http://dbpedia.org/ontology/releaseDate> ?date . FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) }",
      "triples": [
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatAmericanHarmonicaPlayers>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Long_Branch,_New_Jersey>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Patti_Scialfa>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bruce_Springsteen__PersonFunction__1>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Wall_of_Sound>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Jessica_Springsteen>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:20th-century_American_guitarists>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Bruce_Springsteen>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://www.w3.org/2000/01/rdf-schema#label> \"Bruce Springsteen\"@en",
        "<http://dbpedia.org/resource/Julianne_Phillips> <http://www.w3.org/2000/01/rdf-schema#label> \"Julianne Phillips\"@en",
        "<http://dbpedia.org/resource/Patti_Scialfa> <http://www.w3.org/2000/01/rdf-schema#label> \"Patti Scialfa\"@en",
        "<http://dbpedia.org/resource/East_Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/East_Berlin>",
        "<http://dbpedia.org/resource/New_Netherland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/New_Amsterdam>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/birthDate> \"\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/birthName> \"Bruce Frederick Joseph Springsteen\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/birthName> \"Bruce Frederick Joseph Springsteen\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/birthPlace> \"Long Branch, New Jersey, U.S.\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Pamela_Springsteen>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Pamela_Springsteen>",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/spouse> \"\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/name> \"Bruce Springsteen\"@en",
        "<http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/property/occupation> \"musician\"@en",
        "<http://dbpedia.org/resource/Long_Branch,_New_Jersey> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>",
        "<http://dbpedia.org/resource/Pamela_Springsteen> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Freehold_Township,_New_Jersey>"
      ]
    },
    {
      "question": "Give me all Seven Wonders of the Ancient World.",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }",
      "triples": [
        "<http://dbpedia.org/resource/Seven_Network> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEnglish-languageTelevisionStationsInAustralia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Freeview_(Australia)>",
        "<http://dbpedia.org/resource/Seven_Network> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Television_networks_in_Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Eveleigh,_New_South_Wales>",
        "<http://dbpedia.org/resource/Seven_Network> <http://www.w3.org/2000/01/rdf-schema#label> \"Seven Network\"@en",
        "<http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Canberra>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Seven_West_Media>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/headquarters> \"Eveleigh, New South Wales\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/country> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/name> \"Seven Network\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/area> <http://dbpedia.org/resource/BTQ>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/language> \"English\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Seven_West_Media>",
        "<http://dbpedia.org/resource/Seven_West_Media> <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Seven_Group_Holdings>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/broadcastNetwork> <http://dbpedia.org/resource/Seven_(Southern_Cross_Austereo)>"
      ]
    }
  ]
}
