{
  "questions": [
    {
      "question": "Give me all islands that belong to Japan.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
      "triples": [
        "<http://dbpedia.org/resource/Japan> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatCountries>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Naruhito>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Japanese_yen>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Confucianism>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tokyo>",
        "<http://dbpedia.org/resource/Japan> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:East_Asian_countries>",
        "<http://dbpedia.org/resource/Japan> <http://www.w3.org/2000/01/rdf-schema#label> \"Japan\"@en",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Japan_Standard_Time>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Unitary_state>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Japanese_language>",
        "<http://dbpedia.org/resource/British_Raj> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Shimla>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Ashikaga_shogunate> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Heian-ky\u014d>",
        "<http://dbpedia.org/resource/Kenmu_Restoration> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Heian-ky\u014d>",
        "<http://dbpedia.org/resource/Empire_of_Japan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tokyo>",
        "<http://dbpedia.org/resource/Tokugawa_shogunate> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Heian-ky\u014d>",
        "<http://dbpedia.org/resource/Yamatai> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yamato_Province>",
        "<http://dbpedia.org/resource/Portuguese_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>",
        "<http://dbpedia.org/resource/Korea_under_Japanese_rule> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Seoul>",
        "<http://dbpedia.org/resource/Kamakura_shogunate> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Kamakura>",
        "<http://dbpedia.org/resource/Taiwan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Taipei>",
        "<http://dbpedia.org/resource/German_colonial_empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Nazi_Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/governmentType> <http://dbpedia.org/resource/Parliamentary_system>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/currency> <http://dbpedia.org/resource/Japanese_yen>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/languages> <http://dbpedia.org/resource/Japanese_language>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/largestCity> \"capital\"@en",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/leaderTitle> <http://dbpedia.org/resource/Emperor_of_Japan>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/property/capital> <http://dbpedia.org/resource/Tokyo>"
      ]
    },
    {
      "question": "Give me all Apollo 14 astronauts.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
      "triples": [
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ArtificialSatellite>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/List_of_Apollo_missions>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Retroreflector>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Alan_Shepard>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/2000/01/rdf-schema#label> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Apollo_program>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Grumman>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/name> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/manufacturer> \"LM: Grumman\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Lunar Module Pilot\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>"
      ]
    },
    {
      "question": "Give me all soccer clubs in the Premier League.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
      "triples": [
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.ontologydesignpatterns.org/ont/d0.owl#Activity>",
        "<http://dbpedia.org/resource/Premier_League> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WebSite106359193>",
        "<http://dbpedia.org/resource/Premier_League> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/England>",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Overtime_(sports)>",
        "<http://dbpedia.org/resource/Premier_League> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Transparency_(behavior)>",
        "<http://dbpedia.org/resource/Association_football> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Physical_education>",
        "<http://dbpedia.org/resource/Premier_League> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Premier_League>",
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/2000/01/rdf-schema#label> \"Association football\"@en",
        "<http://dbpedia.org/resource/Premier_League> <http://www.w3.org/2000/01/rdf-schema#label> \"Premier League\"@en",
        "<http://dbpedia.org/resource/Song_dynasty> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lin'an_Prefecture>",
        "<http://dbpedia.org/resource/Han_dynasty> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Chang'an>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>",
        "<http://dbpedia.org/resource/Spain> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Madrid>",
        "<http://dbpedia.org/resource/Premier_League> <http://dbpedia.org/property/country> \"England\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/nickname> \"\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/name> \"Association football\"@en",
        "<http://dbpedia.org/resource/Premier_League> <http://dbpedia.org/property/name> \"Premier League\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/Football_pitch>"
      ]
    },
    {
      "question": "Give me all ESA astronauts.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
      "triples": [
        "<http://dbpedia.org/resource/European_Space_Agency> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Unit108189659>",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/SpaceX_Dragon_2>",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Space_agencies>",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://www.w3.org/2000/01/rdf-schema#label> \"European Space Agency\"@en",
        "<http://dbpedia.org/resource/Italy> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/United_States> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Washington,_D.C.>",
        "<http://dbpedia.org/resource/East_Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/East_Berlin>",
        "<http://dbpedia.org/resource/Netherlands> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Amsterdam>",
        "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>",
        "<http://dbpedia.org/resource/West_Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bonn>",
        "<http://dbpedia.org/resource/Denmark> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Copenhagen>",
        "<http://dbpedia.org/resource/Sweden> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Stockholm>",
        "<http://dbpedia.org/resource/Spain> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Madrid>",
        "<http://dbpedia.org/resource/France> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Paris>",
        "<http://dbpedia.org/resource/Switzerland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bern>",
        "<http://dbpedia.org/resource/Turkey> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ankara>",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/property/owner> \"\"@en",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/property/headquarters> \"Paris, \u00cele-de-France, France\"@en",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/property/name> \"European Space Agency\"@en",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/property/language> \"English, French, and German\"@en",
        "<http://dbpedia.org/resource/European_Space_Agency> <http://dbpedia.org/property/nativeName> \"Agen\u021bia Spa\u021bial\u0103 European\u0103\"@en"
      ]
    },
    {
      "question": "Give me a list of all bandleaders that play trumpet.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
      "triples": [
        "<http://dbpedia.org/resource/Trumpet> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Clint_McLaughlin>",
        "<http://dbpedia.org/resource/Trumpet> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Marching_band_instruments>",
        "<http://dbpedia.org/resource/Trumpet> <http://www.w3.org/2000/01/rdf-schema#label> \"Trumpet\"@en",
        "<http://dbpedia.org/resource/Peru> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lima>",
        "<http://dbpedia.org/resource/Moche_culture> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moche_Valley>",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/property/name> \"Trumpet\"@en",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/property/related> <http://dbpedia.org/resource/Flugelhorn>"
      ]
    },
    {
      "question": "Give me all movies with Tom Cruise.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
      "triples": [
        "<http://dbpedia.org/resource/Tom_Cruise> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatActorsFromNewYork>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Syracuse,_New_York>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Tom_Cruise__PersonFunction__1>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Tom_Cruise>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Cincinnati>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:People_with_dyslexia>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Tom_Cruise>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://www.w3.org/2000/01/rdf-schema#label> \"Tom Cruise\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/birthName> \"Thomas Cruise Mapother IV\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/birthName> \"Thomas Cruise Mapother IV\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/birthPlace> \"Syracuse, New York, U.S.\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Tom_Cruise>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/William_Mapother>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/William_Mapother>",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/name> \"Tom Cruise\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/occupation> \"producer\"@en",
        "<http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/species> \"no\"@en",
        "<http://dbpedia.org/resource/William_Mapother> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Louisville,_Kentucky>"
      ]
    },
    {
      "question": "Is Darth Vader Luke\u2019s father?",
      "query": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> }",
      "triples": [
        "<http://dbpedia.org/resource/Darth_Vader> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Principal110474950>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Padm\u00e9_Amidala>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/George_Lucas>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Sith>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Category:Fictional_regicides>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Sebastian_Shaw_(actor)>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Film_supervillains>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/title> \"Darth Vader designers\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://www.w3.org/2000/01/rdf-schema#label> \"Darth Vader\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/children> \"Leia Organa Solo\"@en",
        "<http://dbpedia.org/resource/Padm\u00e9_Amidala> <http://www.w3.org/2000/01/rdf-schema#label> \"Padm\u00e9 Amidala\"@en",
        "<http://dbpedia.org/resource/Luke_Skywalker> <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Skywalker_family>",
        "<http://dbpedia.org/resource/Princess_Leia> <http://dbpedia.org/property/children> \"Jaina Solo\"@en",
        "<http://dbpedia.org/resource/Luke_Skywalker> <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Mara_Jade>",
        "<http://dbpedia.org/resource/Princess_Leia> <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Han_Solo>",
        "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Star_Wars>",
        "<http://dbpedia.org/resource/Luke_Skywalker> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Skywalker_family>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/alias> \"The Chosen One\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/series> <http://dbpedia.org/resource/Star_Wars>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/relatives> \"Legends:\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Mara_Jade>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Padm\u00e9_Amidala>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/nickname> \"Ani\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/George_Lucas>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/affiliation> \"\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/name> \"Darth Vader\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/subject> \"anakin-skywalker\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Star_Wars_Rebels>",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/family> \"Owen Lars\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/occupation> \"\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/portrayer> \"David Prowse\"@en",
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/gender> \"Male\"@en",
        "<http://dbpedia.org/resource/George_Lucas> <http://dbpedia.org/property/birthPlace> \"Modesto, California, U.S.\"@en",
        "<http://dbpedia.org/resource/George_Lucas> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/George_Lucas__PersonFunction__1>",
        "<http://dbpedia.org/resource/Rogue_One> <http://dbpedia.org/property/editing> \"John Gilroy\"@en"
      ]
    },
    {
      "question": "Give me all breeds of the German Shepherd dog.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
      "triples": [
        "<http://dbpedia.org/resource/SuperFetch_(TV_series)> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Dog>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Heavy_metal_music>",
        "<http://dbpedia.org/resource/German_Shepherd> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/BiologicalGroup107941170>",
        "<http://dbpedia.org/resource/Dog> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://umbel.org/umbel/rc/Mammal>",
        "<http://dbpedia.org/resource/German_Shepherd> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Secretariat_of_National_Defense_(Mexico)>",
        "<http://dbpedia.org/resource/Dog> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Hel_(location)>",
        "<http://dbpedia.org/resource/German_Shepherd> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:FCI_breeds>",
        "<http://dbpedia.org/resource/Dog> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Dogs>",
        "<http://dbpedia.org/resource/Dog> <http://dbpedia.org/property/title> \"Dog sounds\"@en",
        "<http://dbpedia.org/resource/German_Shepherd> <http://www.w3.org/2000/01/rdf-schema#label> \"German Shepherd\"@en",
        "<http://dbpedia.org/resource/Dog> <http://www.w3.org/2000/01/rdf-schema#label> \"Dog\"@en",
        "<http://dbpedia.org/resource/Hungary> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Budapest>",
        "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Korea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Pyongyang>",
        "<http://dbpedia.org/resource/Switzerland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/De_jure>",
        "<http://dbpedia.org/resource/Marshall_Islands> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Majuro>",
        "<http://dbpedia.org/resource/Vietnam> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Hanoi>",
        "<http://dbpedia.org/resource/Japan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tokyo>",
        "<http://dbpedia.org/resource/Cook_Islands> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Avarua>",
        "<http://dbpedia.org/resource/Gilbert_Islands> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/South_Tarawa>",
        "<http://dbpedia.org/resource/Neo-Babylonian_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Babylon>",
        "<http://dbpedia.org/resource/Philippines> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Manila>",
        "<http://dbpedia.org/resource/Palau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ngerulmud>",
        "<http://dbpedia.org/resource/Babylonia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Babylon>",
        "<http://dbpedia.org/resource/Tonga> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nuku\u02bbalofa>",
        "<http://dbpedia.org/resource/Neo-Assyrian_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Assur>",
        "<http://dbpedia.org/resource/Vanuatu> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Port_Vila>",
        "<http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Beijing>",
        "<http://dbpedia.org/resource/German_Shepherd> <http://dbpedia.org/property/date> \"August 2021\"@en",
        "<http://dbpedia.org/resource/German_Shepherd> <http://dbpedia.org/property/country> \"Germany\"@en",
        "<http://dbpedia.org/resource/German_Shepherd> <http://dbpedia.org/property/nickname> \"Shepherd\"@en",
        "<http://dbpedia.org/resource/German_Shepherd> <http://dbpedia.org/property/name> \"German Shepherd\"@en",
        "<http://dbpedia.org/resource/Dog> <http://dbpedia.org/property/name> \"Dog\"@en",
        "<http://dbpedia.org/resource/Dog> <http://dbpedia.org/property/species> \"familiaris\"@en",
        "<http://dbpedia.org/resource/Dog> <http://dbpedia.org/property/format> <http://dbpedia.org/resource/Ogg>"
      ]
    },
    {
      "question": "Give me all the TV shows with Neil Patrick Harris.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
      "triples": [
        "<http://dbpedia.org/resource/Saint_Patrick> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatMedievalIrishSaints>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Roman_Britain>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Ulaid>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/March_17>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Romano-British_saints>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://www.w3.org/2000/01/rdf-schema#label> \"Saint Patrick\"@en",
        "<http://dbpedia.org/resource/Nigeria> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Abuja>",
        "<http://dbpedia.org/resource/Roman_Britain> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Camulodunum>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>",
        "<http://dbpedia.org/resource/United_Kingdom_of_Great_Britain_and_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/birthPlace> \"Roman Britain\"@en",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/deathPlace> \"Saul, D\u00e1l Fiatach, Ulaid, Gaelic Ireland\"@en",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/veneratedIn> <http://dbpedia.org/resource/Anglican_Communion>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/name> \"Patrick\"@en",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Glastonbury_Abbey>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/majorShrine> <http://dbpedia.org/resource/England>",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/property/species> \"no\"@en",
        "<http://dbpedia.org/resource/Saint_Patrick> <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Anglican_Communion>"
      ]
    }
  ]
}
