{
  "questions": [
    {
      "question": "Show a list of soccer clubs that play in the Bundesliga.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
      "triples": [
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.ontologydesignpatterns.org/ont/d0.owl#Activity>",
        "<http://dbpedia.org/resource/Bundesliga> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/League108231184>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany>",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Overtime_(sports)>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/1._FC_Saarbr\u00fccken>",
        "<http://dbpedia.org/resource/Association_football> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Physical_education>",
        "<http://dbpedia.org/resource/Bundesliga> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Top_level_football_leagues_in_Europe>",
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/2000/01/rdf-schema#label> \"Association football\"@en",
        "<http://dbpedia.org/resource/Bundesliga> <http://www.w3.org/2000/01/rdf-schema#label> \"Bundesliga\"@en",
        "<http://dbpedia.org/resource/Song_dynasty> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lin'an_Prefecture>",
        "<http://dbpedia.org/resource/Han_dynasty> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Chang'an>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>",
        "<http://dbpedia.org/resource/East_Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/East_Berlin>",
        "<http://dbpedia.org/resource/Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/date> \"September 2020\"@en",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/country> \"Germany\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/nickname> \"\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/name> \"Association football\"@en",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/name> \"Bundesliga\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/Football_pitch>"
      ]
    },
    {
      "question": "Give me the capitals of all countries that the Himalayas run through.",
      "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Himalayas> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MountainRange>",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Pakistan>",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Antarctica>",
        "<http://dbpedia.org/resource/Himalayas> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Landforms_of_South_Asia>",
        "<http://dbpedia.org/resource/Himalayas> <http://www.w3.org/2000/01/rdf-schema#label> \"Himalayas\"@en",
        "<http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Beijing>",
        "<http://dbpedia.org/resource/Pakistan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Islamabad>",
        "<http://dbpedia.org/resource/Upper_Mustang> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lomanthang_Rural_Municipality>",
        "<http://dbpedia.org/resource/British_Raj> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/New_Delhi>",
        "<http://dbpedia.org/resource/Bhutan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Thimphu>",
        "<http://dbpedia.org/resource/Myanmar> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Naypyidaw>",
        "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/New_Delhi>",
        "<http://dbpedia.org/resource/Colombia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bogot\u00e1>",
        "<http://dbpedia.org/resource/Bangladesh> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dhaka>",
        "<http://dbpedia.org/resource/Nepal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Kathmandu>",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/highest> <http://dbpedia.org/resource/Mount_Everest>",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/country> \". Sovereignty in the Kashmir region is disputed by India, Pakistan, and China.\"@en",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/name> \"Himalayas\"@en",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/nativeName> \"Him\u0101laya\"@en"
      ]
    },
    {
      "question": "Show me all books in Asimov's Foundation series.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "triples": [
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> \"\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Object100002684>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Janet_Asimov>",
        "<http://dbpedia.org/resource/Foundation_series> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Military_science_fiction_novels>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/title> \"Foundation series\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://www.w3.org/2000/01/rdf-schema#label> \"Foundation series\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Isaac_Asimov>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/country> \"United States\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction>",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/name> \"The Foundation series\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/publisher> \"Astounding Magazine, Gnome Press, Spectra, Doubleday\"@en",
        "<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/language> \"English\"@en",
        "<http://dbpedia.org/resource/Isaac_Asimov> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Mystery_fiction>"
      ]
    },
    {
      "question": "List all boardgames by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Structure105726345>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Irish_Statute_Book>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Greenwich Mean Time\"@en",
        "<http://dbpedia.org/resource/Burkina_Faso> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ouagadougou>",
        "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>",
        "<http://dbpedia.org/resource/The_Gambia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Banjul>",
        "<http://dbpedia.org/resource/Togo> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lom\u00e9>",
        "<http://dbpedia.org/resource/Portugal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>",
        "<http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ottawa>",
        "<http://dbpedia.org/resource/Guinea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Conakry>",
        "<http://dbpedia.org/resource/Sierra_Leone> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Freetown>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Constantinople>",
        "<http://dbpedia.org/resource/Mali> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bamako>",
        "<http://dbpedia.org/resource/Guinea-Bissau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bissau>",
        "<http://dbpedia.org/resource/Ghana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>",
        "<http://dbpedia.org/resource/Liberia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Monrovia>",
        "<http://dbpedia.org/resource/Mauritania> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nouakchott>",
        "<http://dbpedia.org/resource/Republic_of_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dublin>",
        "<http://dbpedia.org/resource/Senegal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dakar>",
        "<http://dbpedia.org/resource/Ivory_Coast> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yamoussoukro>",
        "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>",
        "<http://dbpedia.org/resource/Sahrawi_Arab_Democratic_Republic> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tifariti>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>"
      ]
    },
    {
      "question": "Give me the Apollo 14 astronauts.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
      "triples": [
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ArtificialSatellite>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/List_of_Apollo_missions>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Retroreflector>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Alan_Shepard>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/2000/01/rdf-schema#label> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Apollo_program>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Grumman>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/name> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/manufacturer> \"LM: Grumman\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Lunar Module Pilot\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>"
      ]
    },
    {
      "question": "Give me a list of all trumpet players that were bandleaders.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
      "triples": [
        "<http://dbpedia.org/resource/Trumpet> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Clint_McLaughlin>",
        "<http://dbpedia.org/resource/Trumpet> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Marching_band_instruments>",
        "<http://dbpedia.org/resource/Trumpet> <http://www.w3.org/2000/01/rdf-schema#label> \"Trumpet\"@en",
        "<http://dbpedia.org/resource/Peru> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lima>",
        "<http://dbpedia.org/resource/Moche_culture> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moche_Valley>",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/property/name> \"Trumpet\"@en",
        "<http://dbpedia.org/resource/Trumpet> <http://dbpedia.org/property/related> <http://dbpedia.org/resource/Flugelhorn>"
      ]
    },
    {
      "question": "Who created Batman?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>",
        "<http://dbpedia.org/resource/Batman_(Earth-Two)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Batman>",
        "<http://dbpedia.org/resource/Batman_(TV_series)> <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/William_Dozier>",
        "<http://dbpedia.org/resource/Batman> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/FictionalCharacter109587565>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Imprint_(trade_name)>",
        "<http://dbpedia.org/resource/Batman> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Characters_created_by_Bob_Kane>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/title> \"Articles and topics related to Batman\"@en",
        "<http://dbpedia.org/resource/Batman> <http://www.w3.org/2000/01/rdf-schema#label> \"Batman\"@en",
        "<http://dbpedia.org/resource/Bill_Finger> <http://dbpedia.org/property/nationality> \"American\"@en",
        "<http://dbpedia.org/resource/Bob_Kane> <http://dbpedia.org/property/nationality> \"American\"@en",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/recognizedRegionalLanguages> \"American\"@en",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/state> \"collapsed\"@en",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/DC_Comics>",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/creators> \"\"@en",
        "<http://dbpedia.org/resource/Bill_Finger> <http://dbpedia.org/property/birthPlace> \"Denver, Colorado, U.S.\"@en",
        "<http://dbpedia.org/resource/Bob_Kane> <http://dbpedia.org/property/birthPlace> \"New York City, New York, U.S.\"@en",
        "<http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/characterName> \"Batman\"@en"
      ]
    },
    {
      "question": "Give me all launch pads operated by NASA.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
      "triples": [
        "<http://dbpedia.org/resource/Javaid_Laghari> <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/NASA> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AdministrativeUnit108077292>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Pamela_Melroy>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Sputnik_1>",
        "<http://dbpedia.org/resource/NASA> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Articles_containing_video_clips>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/title> \"Articles and topics related to NASA\"@en",
        "<http://dbpedia.org/resource/NASA> <http://www.w3.org/2000/01/rdf-schema#label> \"NASA\"@en",
        "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Louisiana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Baton_Rouge,_Louisiana>",
        "<http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/state> \"collapsed\"@en",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/name> \"National Aeronautics and Space Administration\"@en",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/jurisdiction> <http://dbpedia.org/resource/Federal_government_of_the_United_States>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/leaderTitle> <http://dbpedia.org/resource/List_of_administrators_and_deputy_administrators_of_NASA>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/motto> \"For the Benefit of All\"@en",
        "<http://dbpedia.org/resource/Washington,_D.C.> <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Eastern_Time_Zone>"
      ]
    },
    {
      "question": "List all the musicals with music by Elton John.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
      "triples": [
        "<http://dbpedia.org/resource/Elton_John> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatBritishRecordProducers>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Pinner>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/David_Furnish>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Elton_John__PersonFunction__1>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Sir>",
        "<http://dbpedia.org/resource/Elton_John> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Rocket_Records_artists>",
        "<http://dbpedia.org/resource/Elton_John> <http://www.w3.org/2000/01/rdf-schema#label> \"Elton John\"@en",
        "<http://dbpedia.org/resource/David_Furnish> <http://www.w3.org/2000/01/rdf-schema#label> \"David Furnish\"@en",
        "<http://dbpedia.org/resource/Azerbaijan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Baku>",
        "<http://dbpedia.org/resource/South_Africa> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Cape_Town>",
        "<http://dbpedia.org/resource/Israel> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Jerusalem>",
        "<http://dbpedia.org/resource/Armenia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yerevan>",
        "<http://dbpedia.org/resource/Republic_of_Artsakh> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Stepanakert>",
        "<http://dbpedia.org/resource/Soviet_Union> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Iraq> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Baghdad>",
        "<http://dbpedia.org/resource/Chile> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Santiago>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/property/birthName> \"Reginald Kenneth Dwight\"@en",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/ontology/birthName> \"Reginald Kenneth Dwight\"@en",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/property/birthPlace> \"Pinner, Middlesex, England\"@en",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/David_Furnish>",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/property/name> \"Elton John\"@en",
        "<http://dbpedia.org/resource/Elton_John> <http://dbpedia.org/property/occupation> \"\"@en",
        "<http://dbpedia.org/resource/Pinner> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom>"
      ]
    },
    {
      "question": "Give me the runtime of Toy Story.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "triples": [
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/runtime> \"282.0\"^^<http://www.w3.org/2001/XMLSchema#double>"
      ]
    },
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Structure105726345>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Irish_Statute_Book>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Greenwich Mean Time\"@en",
        "<http://dbpedia.org/resource/Burkina_Faso> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ouagadougou>",
        "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>",
        "<http://dbpedia.org/resource/The_Gambia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Banjul>",
        "<http://dbpedia.org/resource/Togo> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lom\u00e9>",
        "<http://dbpedia.org/resource/Portugal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>",
        "<http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ottawa>",
        "<http://dbpedia.org/resource/Guinea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Conakry>",
        "<http://dbpedia.org/resource/Sierra_Leone> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Freetown>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Constantinople>",
        "<http://dbpedia.org/resource/Mali> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bamako>",
        "<http://dbpedia.org/resource/Guinea-Bissau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bissau>",
        "<http://dbpedia.org/resource/Ghana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>",
        "<http://dbpedia.org/resource/Liberia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Monrovia>",
        "<http://dbpedia.org/resource/Mauritania> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nouakchott>",
        "<http://dbpedia.org/resource/Republic_of_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dublin>",
        "<http://dbpedia.org/resource/Senegal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dakar>",
        "<http://dbpedia.org/resource/Ivory_Coast> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Yamoussoukro>",
        "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>",
        "<http://dbpedia.org/resource/Sahrawi_Arab_Democratic_Republic> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tifariti>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>"
      ]
    },
    {
      "question": "Give me all members of Prodigy.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
      "triples": []
    },
    {
      "question": "Show me all museums in London.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
      "triples": [
        "<http://dbpedia.org/resource/London> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/District108552138>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/timezone> <http://dbpedia.org/resource/Greenwich_Mean_Time>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Capital_city>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Chester>",
        "<http://dbpedia.org/resource/London> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Southern_England>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Outline_of_London>",
        "<http://dbpedia.org/resource/London> <http://www.w3.org/2000/01/rdf-schema#label> \"London\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/establishedDate> \"AD\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/British_Summer_Time>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Directly_elected_mayors_in_England_and_Wales>",
        "<http://dbpedia.org/resource/Germany> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Constantinople>",
        "<http://dbpedia.org/resource/Republic_of_Ragusa> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dubrovnik>",
        "<http://dbpedia.org/resource/Roman_Britain> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Londinium>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Ancient_Rome> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/politicalLeader> <http://dbpedia.org/resource/London__PoliticalFunction__2>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/subdivisionName> \"United Kingdom\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/governmentType> \"Executive mayoralty and deliberative assembly within unitary constitutional monarchy\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/name> \"London\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/governingBody> \"\u2022 Mayor Sadiq Khan\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/ontology/governingBody> <http://dbpedia.org/resource/Greater_London_Authority>",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/settlementType> \"Capital city and megacity\"@en",
        "<http://dbpedia.org/resource/London> <http://dbpedia.org/property/leaderTitle> \"London Assembly\"@en",
        "<http://dbpedia.org/resource/Parliament_of_the_United_Kingdom> <http://dbpedia.org/property/houses> <http://dbpedia.org/resource/House_of_Lords>"
      ]
    }
  ]
}
