{
  "questions": [
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/TimeUnit115154774>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Time_zones>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"GMT\"@eo",
        "<http://dbpedia.org/resource/S\u00e9gou> <http://dbpedia.org/property/timezone> <http://dbpedia.org/resource/Greenwich_Mean_Time>",
        "<http://dbpedia.org/resource/GMT_Time> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Greenwich_Mean_Time>"
      ]
    },
    {
      "question": "Is Cola a beverage?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "triples": [
        "<http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Substance100019613>",
        "<http://dbpedia.org/resource/Soft_drink> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2002/07/owl#Thing>",
        "<http://dbpedia.org/resource/Cola> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Cola>",
        "<http://dbpedia.org/resource/Soft_drink> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Soft_drinks>",
        "<http://dbpedia.org/resource/Sibat_Tomarchio> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Ice_cream_float> <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://www.w3.org/2000/01/rdf-schema#label> \"Cola\"@de",
        "<http://dbpedia.org/resource/Soft_drink> <http://www.w3.org/2000/01/rdf-schema#label> \"\u0645\u0634\u0631\u0648\u0628 \u063a\u0627\u0632\u064a\"@ar",
        "<http://dbpedia.org/resource/David_Ludwig_(physician)> <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Virgin_Drinks> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Grupo_Tampico> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Frostop> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/List_of_The_Complete_Guide_to_Everything_episodes> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/United_States>",
        "<http://dbpedia.org/resource/Red_Bull_Simply_Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Dad's_Root_Beer> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/date> \"April 2021\"@en",
        "<http://dbpedia.org/resource/Soft_drink> <http://dbpedia.org/property/date> \"January 2021\"@en",
        "<http://dbpedia.org/resource/Chloe_Flower> <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Frostop> <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola_drinks> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Health_effects_of_soda> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/name> \"Cola\"@en",
        "<http://dbpedia.org/resource/Chloe_Flower> <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/R._Stothert's_&_Sons_Ltd> <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Frostop> <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Arts,_Sciences_and_Technology_University_in_Lebanon> <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/manufacturer> \"Various\"@en"
      ]
    },
    {
      "question": "Give me all chemical elements.",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX owl: <http://www.w3.org/2002/07/owl#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type owl:Thing ; dct:subject dbc:Chemical_elements }",
      "triples": [
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2002/07/owl#Thing>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:American_heavy_metal_songs>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/releaseDate> \"1993-02-15\"^^<http://www.w3.org/2001/XMLSchema#date>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://www.w3.org/2000/01/rdf-schema#label> \"Give In to Me\"@ko",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Bill_Bottrell>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Heavy_metal_music>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Michael_Jackson>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/runtime> \"328.0\"^^<http://www.w3.org/2001/XMLSchema#double>",
        "<http://dbpedia.org/resource/King_of_Pop_(album)> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Give_In_to_Me>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/title> \"Give In to Me\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/type> \"single\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/album> <http://dbpedia.org/resource/Dangerous_(Michael_Jackson_album)>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Epic_Records>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/length> \"\"\"* 5:28 \n* 4:42\"\"\"@en",
        "<http://dbpedia.org/resource/Give_in_to_Me> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Give_In_to_Me>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/name> \"Give In to Me\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/producer> \"\"\"* Michael Jackson\n* Bill Bottrell\"\"\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/writer> \"\"\"* Michael Jackson\n* Bill Bottrell\"\"\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Epic_Records>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/artist> \"Michael Jackson featuring Slash\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Whatzupwitu>",
        "<http://dbpedia.org/resource/Heal_the_World> <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Give_In_to_Me>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Heavy_metal_music>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/region> \"Australia\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/recorded> \"\"\"* 1990\n* 1992\"\"\"@en",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Heal_the_World>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Dangerous_(Michael_Jackson_album)>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/property/released> \"1993-02-15\"^^<http://www.w3.org/2001/XMLSchema#date>"
      ]
    }
  ]
}
