{
  "questions": [
    {
      "question": "Show a list of soccer clubs that play in the Bundesliga.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
      "triples": [
        "<http://dbpedia.org/resource/Bundesliga> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Association108049401>",
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://umbel.org/umbel/rc/Action>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany>",
        "<http://dbpedia.org/resource/2002\u201303_Hertha_BSC_season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/ontology/foundingYear> \"1963\"^^<http://www.w3.org/2001/XMLSchema#gYear>",
        "<http://dbpedia.org/resource/Bundesliga> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Bundesliga>",
        "<http://dbpedia.org/resource/Association_football> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Articles_containing_video_clips>",
        "<http://dbpedia.org/resource/Oberliga_S\u00fcdwest_(1945\u20131963)> <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/Association_football> <http://www.w3.org/2000/01/rdf-schema#label> \"\u0424\u0443\u0442\u0431\u043e\u043b\"@uk",
        "<http://dbpedia.org/resource/Bundesliga> <http://www.w3.org/2000/01/rdf-schema#label> \"Lliga alemanya de futbol\"@ca",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/date> \"September 2020\"@en",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/founded> \"1963-08-24\"^^<http://www.w3.org/2001/XMLSchema#date>",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/team> \"11\"^^<http://www.w3.org/2001/XMLSchema#integer>",
        "<http://dbpedia.org/resource/German_Bundesliga> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/name> \"Bundesliga\"@en",
        "<http://dbpedia.org/resource/Chile_at_the_Pan_American_Games> <http://dbpedia.org/property/name> <http://dbpedia.org/resource/Association_football>",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/name> \"Association football\"@en",
        "<http://dbpedia.org/resource/Bundesliga> <http://dbpedia.org/property/country> \"Germany\"@en",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/nickname> <http://dbpedia.org/resource/The_Beautiful_Game>",
        "<http://dbpedia.org/resource/Derek_Rae> <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/Derek_Rae> <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/1972\u201373_VfL_Bochum_season> <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/Association_football> <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/Football_pitch>"
      ]
    },
    {
      "question": "List all boardgames by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/PsychologicalFeature100023100>",
        "<http://dbpedia.org/resource/Dir\u00e9_Cercle> <http://dbpedia.org/property/timezone> <http://dbpedia.org/resource/Greenwich_Mean_Time>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Ora media di Greenwich\"@it",
        "<http://dbpedia.org/resource/Greenwich_mean_time> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Greenwich_Mean_Time>"
      ]
    },
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/PsychologicalFeature100023100>",
        "<http://dbpedia.org/resource/Chichester_District> <http://dbpedia.org/property/timezone> <http://dbpedia.org/resource/Greenwich_Mean_Time>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:1884_introductions>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Ora media di Greenwich\"@it",
        "<http://dbpedia.org/resource/Greenwich_mean_time> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Greenwich_Mean_Time>"
      ]
    },
    {
      "question": "List the seven kings of Rome.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
      "triples": [
        "<http://dbpedia.org/resource/Rome> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatCapitalsInEurope>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Italy>",
        "<http://dbpedia.org/resource/Palazzo_Venezia> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Nicoletta_Elmi> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/elevation> \"21.0\"^^<http://www.w3.org/2001/XMLSchema#double>",
        "<http://dbpedia.org/resource/Casimiro_Gennari> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/leaderName> \"Roberto Gualtieri\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/areaTotal> \"1285410000.0\"^^<http://www.w3.org/2001/XMLSchema#double>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/timezone> <http://dbpedia.org/resource/Central_European_Time>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Capital_city>",
        "<http://dbpedia.org/resource/Rome> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:New_Testament_cities>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/location> \"Rome Urbe Airport\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/title> \"Rome City Centre\"@en",
        "<http://dbpedia.org/resource/Rome> <http://www.w3.org/2000/01/rdf-schema#label> \"Rom, Deux-S\u00e8vres\"@in",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/establishedDate> \"753\"^^<http://www.w3.org/2001/XMLSchema#integer>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Central_European_Time>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Mayor\u2013council_government>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/date> \"December 2014\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/politicalLeader> <http://dbpedia.org/resource/Rome__PoliticalFunction__1>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/elevationM> \"21\"^^<http://www.w3.org/2001/XMLSchema#integer>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/name> \"Rome\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/subdivisionName> \"Italy\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/populationDensity> \"2236.0\"^^<http://www.w3.org/2001/XMLSchema#double>",
        "<http://dbpedia.org/resource/Lorella_Cedroni> <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/governmentType> <http://dbpedia.org/resource/Mayor\u2013council_government>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rex_(title)>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/areaCode> \"06\"",
        "<http://dbpedia.org/resource/Siege_of_Rome_(472)> <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/label> \"Vittoriano\"@en",
        "<http://dbpedia.org/resource/Karl_Ludwig_Schr\u00f6der> <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/founder> \"King Romulus\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/nickname> \"Throne of St. Peter\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/settlementType> \"Capital city and comune\"@en",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/leaderTitle> <http://dbpedia.org/resource/Mayor_of_Rome>",
        "<http://dbpedia.org/resource/Rome> <http://dbpedia.org/property/officialName> \"Roma Capitale\"@en"
      ]
    },
    {
      "question": "Is Cola a beverage?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "triples": [
        "<http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/PhysicalEntity100001930>",
        "<http://dbpedia.org/resource/Soft_drink> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>",
        "<http://dbpedia.org/resource/Virgin_Drinks> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Madeira_Brewery> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Frostop> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:19th-century_inventions>",
        "<http://dbpedia.org/resource/Soft_drink> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Convenience_foods>",
        "<http://dbpedia.org/resource/List_of_The_Complete_Guide_to_Everything_episodes> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/United_States>",
        "<http://dbpedia.org/resource/Soft_drink> <http://www.w3.org/2000/01/rdf-schema#label> \"\u041e\u0441\u0432\u0435\u0436\u0430\u044e\u0449\u0438\u0439 \u043d\u0430\u043f\u0438\u0442\u043e\u043a\"@ru",
        "<http://dbpedia.org/resource/Cola> <http://www.w3.org/2000/01/rdf-schema#label> \"Cola\"@sv",
        "<http://dbpedia.org/resource/Ice_cream_float> <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Wild_Willy's> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/David_Ludwig_(physician)> <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Virgin_Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Star_Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Soft_drink> <http://dbpedia.org/property/date> \"January 2021\"@en",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/date> \"April 2021\"@en",
        "<http://dbpedia.org/resource/Chloe_Flower> <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/F\u00f6roya_Bj\u00f3r> <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola_drinks> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Carbonated_drink> <http://dbpedia.org/ontology/wikiPageRedirects> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/name> \"Cola\"@en",
        "<http://dbpedia.org/resource/Chloe_Flower> <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/War_Horse_Brewing_Company> <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Frostop> <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Soft_drink>",
        "<http://dbpedia.org/resource/Arts,_Sciences_and_Technology_University_in_Lebanon> <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Cola>",
        "<http://dbpedia.org/resource/Cola> <http://dbpedia.org/property/manufacturer> \"Various\"@en"
      ]
    }
  ]
}
