{
  "questions": [
    {
      "question": "Give me the Apollo 14 astronauts.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
      "triples": [
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/NongovernmentalOrganization108009834>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.w3.org/2003/01/geo/wgs84_pos#SpatialThing>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#Event>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpaceMission>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/YagoPermanentlyLocatedEntity>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/List_of_Apollo_missions>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Wilson_Staff>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Goodyear_Tire_and_Rubber_Company>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Mobile_quarantine_facility>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Category:Sample_return_missions>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Harrison_Schmitt>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Alan_Shepard>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Soft_landings_on_the_Moon>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Sample_return_missions>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Extravehicular_activity>",
        "<http://dbpedia.org/resource/Apollo_14> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Apollo_14>",
        "<http://dbpedia.org/resource/Apollo_14> <http://www.w3.org/2000/01/rdf-schema#label> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Apollo_program>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Grumman>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Rockwell_International>",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/name> \"Apollo 14\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/manufacturer> \"LM: Grumman\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/manufacturer> \"CSM: North American Rockwell\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Command Module Pilot\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Commander\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/position> \"Lunar Module Pilot\"@en",
        "<http://dbpedia.org/resource/Apollo_14> <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/NASA> <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Washington,_D.C.>"
      ]
    },
    {
      "question": "Give me all companies in the advertising industry.",
      "query": "SELECT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, \"advertising\", \"i\") } }",
      "triples": []
    },
    {
      "question": "Give me all B-sides of the Ramones.",
      "query": "SELECT DISTINCT ?x WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Ramones>}",
      "triples": []
    },
    {
      "question": "Give me the runtime of Toy Story.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "triples": [
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/runtime> \"282.0\"^^<http://www.w3.org/2001/XMLSchema#double>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/runtime> \"328.0\"^^<http://www.w3.org/2001/XMLSchema#double>"
      ]
    }
  ]
}
