{
    "dataset": {
        "id": "updated-qald-8-train-multilingual"
    },
    "questions": [{
        "id": "18514",
        "answertype": "resource",
        "aggregation": false,
        "onlydbo": true,
        "hybrid": false,
        "question": [{
            "language": "de",
            "string": "Liste alle Musicals mit Musik von Elton John auf.",
            "keywords": "Musicals, Musik von, Elton John "
        }, {
            "language": "en",
            "string": "List all the musicals with music by Elton John.",
            "keywords": "musicals, music by, Elton John "
        }, {
            "language": "hi_IN",
            "string": "\u090f\u0932\u094d\u091f\u0928 \u091c\u0949\u0928 \u0926\u094d\u0935\u093e\u0930\u093e \u0938\u0902\u0917\u0940\u0924 \u0915\u0947 \u0938\u093e\u0925 \u0938\u092d\u0940 \u0938\u0902\u0917\u0940\u0924\u094b\u0902 \u0915\u094b \u0938\u0942\u091a\u0940\u092c\u0926\u094d\u0927 \u0915\u0930\u0947\u0902\u0964",
            "keywords": "\u090f\u0932\u094d\u091f\u0928 \u091c\u0949\u0928 \u0915\u093e \u0938\u0902\u0917\u0940\u0924 "
        }, {
            "language": "it",
            "string": "Elenca tutti i musicals con musiche di Elton John.",
            "keywords": "musicals, musiche, Elton John "
        }, {
            "language": "fr",
            "string": "Donne-moi tous les musicals avec de la musique de de Elton John.",
            "keywords": "musicals, musique, Elton John "
        }, {
            "language": "ro",
            "string": "Listeaz\u0103 toate muzicalurile cu muzic\u0103 de Elton John.",
            "keywords": "muzicaluri, muzic\u0103 de Elton John "
        }, {
            "language": "es",
            "string": "Dame todos los musicales con m\u00fasica de Elton John.",
            "keywords": "musicales, m\u00fasica, Elton John "
        }, {
            "language": "nl",
            "string": "Toen een lijst van alle musicals met muziek van Elton John.",
            "keywords": "musicals, muziek van, Elton John "
        }],
        "query": {
            "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }"
        },
        "answers": [{
            "head": {
                "vars": ["uri"]
            },
            "results": {
                "bindings": [{
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/The_Lion_King_(musical)"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Lestat_(musical)"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Aida_(musical)"
                    }
                }]
            }
        }]
    }, {
        "id": "17022",
        "answertype": "resource",
        "aggregation": false,
        "onlydbo": true,
        "hybrid": false,
        "question": [{
            "language": "de",
            "string": "Gib mir alle kanadischen Grunge-Plattenfirmen.",
            "keywords": "kanadisch, Plattenfirma, Grunge "
        }, {
            "language": "ru",
            "string": "\u0414\u0430\u0439\u0442\u0435 \u043c\u0435\u043d\u044f \u0432\u0441\u0435 \u043a\u0430\u043d\u0430\u0434\u0435\u0446 Grunge \u0437\u0430\u043f\u0438\u0441\u044c \u044d\u0442\u0438\u043a\u0435\u0442\u043a\u0438. ",
            "keywords": "\u0437\u0430\u043f\u0438\u0441\u044c \u043c\u0435\u0442\u043a\u0430 , \u043a\u0430\u043d\u0430\u0434\u0435\u0446 , Grunge  "
        }, {
            "language": "pt",
            "string": "Dar mim todos canadense Grunge registro r\u00f3tulos. ",
            "keywords": "registro r\u00f3tulo , canadense , Grunge  "
        }, {
            "language": "en",
            "string": "Give me all Canadian Grunge record labels.",
            "keywords": "record label, Canadian, Grunge "
        }, {
            "language": "hi_IN",
            "string": "\u092e\u0941\u091d\u0947 \u0938\u092d\u0940 \u0915\u0948\u0928\u0947\u0921\u093f\u092f\u0928 \u0917\u094d\u0930\u093e\u0902\u091c \u0930\u093f\u0915\u0949\u0930\u094d\u0921 \u0932\u0947\u092c\u0932 \u0915\u0940 \u0938\u0942\u091a\u093f \u0926\u0947\u0902\u0964",
            "keywords": "\u0915\u0948\u0928\u0947\u0921\u093f\u092f\u0928, \u0917\u094d\u0930\u093e\u0902\u091c, \u0930\u093f\u0915\u0949\u0930\u094d\u0921 \u0932\u0947\u092c\u0932 "
        }, {
            "language": "fa",
            "string": "  \u0628\u0631\u0686\u0633\u0628 \u0647\u0627.  \u0631\u06a9\u0648\u0631\u062f  \u06af\u0631\u0627\u0646\u062c  \u06a9\u0627\u0646\u0627\u062f\u0627\u06cc\u06cc  \u0647\u0645\u0647  \u0645\u0646  \u062f\u0627\u062f\u0646",
            "keywords": "  \u0628\u0631\u0686\u0633\u0628  \u0631\u06a9\u0648\u0631\u062f, \u06a9\u0627\u0646\u0627\u062f\u0627\u06cc\u06cc, \u06af\u0631\u0627\u0646\u062c "
        }, {
            "language": "it",
            "string": "Dammi tutti i produttori canadesi di musica Grunge.",
            "keywords": "produttore di musica, canadese, Grunge "
        }, {
            "language": "fr",
            "string": "Donnes-moi tous les labels discographiques canadiens de grunge.",
            "keywords": "labels discographiques, canadiens, grunge "
        }, {
            "language": "ro",
            "string": "Da pe mine toate canadian Grunge record etichete. ",
            "keywords": "record eticheta , canadian , Grunge  "
        }, {
            "language": "es",
            "string": "Dame todos las empresas canadienses productoras de m\u00fasica Grunge.",
            "keywords": "empresa productora de m\u00fasica, canadiense, Grunge "
        }, {
            "language": "nl",
            "string": "Noem alle Canadese grunge-platenlabels.",
            "keywords": "Canadees, platenlabel, Grunge "
        }],
        "query": {
            "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }"
        },
        "answers": [{
            "head": {
                "vars": ["uri"]
            },
            "results": {
                "bindings": [{
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Murderecords"
                    }
                }]
            }
        }]
    }, {
        "id": "17117",
        "answertype": "resource",
        "aggregation": false,
        "onlydbo": true,
        "hybrid": false,
        "question": [{
            "language": "de",
            "string": "Zeig mir das Buch, das Muhammad Ali geschrieben hat.",
            "keywords": "Buch, geschrieben, Muhammad Ali "
        }, {
            "language": "ru",
            "string": "\u041f\u043e\u043a\u0430\u0437\u0430\u0442\u044c \u043c\u0435\u043d\u044f  \u043a\u043d\u0438\u0433\u0430 \u0447\u0442\u043e \u041c\u0443\u0445\u0430\u043c\u043c\u0435\u0434 \u0438\u043b\u0438 \u043d\u0430\u043f\u0438\u0441\u0430\u043b. ",
            "keywords": "\u043a\u043d\u0438\u0433\u0430 , \u043f\u0438\u0441\u0430\u043b , \u041c\u0443\u0445\u0430\u043c\u043c\u0435\u0434 \u0438\u043b\u0438  "
        }, {
            "language": "pt",
            "string": "exposi\u00e7\u00e3o mim a livro aquele Maom\u00e9 Mas escrevi. ",
            "keywords": "livro , escrevi , Maom\u00e9 Mas  "
        }, {
            "language": "en",
            "string": "Show me the book that Muhammad Ali wrote.",
            "keywords": "book, wrote, Muhammad Ali "
        }, {
            "language": "hi_IN",
            "string": "\u092e\u0941\u091d\u0947 \u0915\u093f\u0924\u093e\u092c \u092c\u0924\u093e\u0913 \u091c\u094b \u092e\u0941\u0939\u092e\u094d\u092e\u0926 \u0905\u0932\u0940 \u0928\u0947 \u0932\u093f\u0916\u0940 \u0925\u0940\u0964",
            "keywords": "\u0915\u093f\u0924\u093e\u092c, \u092e\u0941\u0939\u092e\u094d\u092e\u0926 \u0905\u0932\u0940, \u0932\u093f\u0916\u0940 "
        }, {
            "language": "fa",
            "string": "  \u0646\u0648\u0634\u062a.  \u0627\u0645\u0627  \u0645\u062d\u0645\u062f  \u0622\u0646  \u06a9\u062a\u0627\u0628  \u0627\u06cc\u0646  \u0645\u0646  \u0646\u0645\u0627\u06cc\u0634",
            "keywords": "  \u06a9\u062a\u0627\u0628, \u0646\u0648\u0634\u062a, \u0627\u0645\u0627  \u0645\u062d\u0645\u062f "
        }, {
            "language": "it",
            "string": "Mostrami il libro scritto da Muhammad Ali.",
            "keywords": "libro, autore, Muhammad Ali "
        }, {
            "language": "fr",
            "string": "Donne-moi le livre \u00e9crit par Muhammad Ali.",
            "keywords": "livre, par Muhammad Ali "
        }, {
            "language": "ro",
            "string": "Arat\u0103-mi cartea pe care a scris-o Muhammad Ali.",
            "keywords": "carte, scris, Muhammad Ali "
        }, {
            "language": "es",
            "string": "Mu\u00e9strame el libro escrito por Muhammad Ali.",
            "keywords": "libro, autor, Muhammad Ali "
        }, {
            "language": "nl",
            "string": "Toen het boek dat Muhammad Ali heeft geschreven.",
            "keywords": "boek, geschreven, Muhammad Ali "
        }],
        "query": {
            "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }"
        },
        "answers": [{
            "head": {
                "vars": ["uri"]
            },
            "results": {
                "bindings": [{
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/The_Greatest:_My_Own_Story"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
                    }
                }]
            }
        }]
    }, {
        "id": "16998",
        "answertype": "resource",
        "aggregation": false,
        "onlydbo": true,
        "hybrid": false,
        "question": [{
            "language": "de",
            "string": "Zeig mir Hemmingways Autobiographie.",
            "keywords": "Hemmingway, Autobiographie "
        }, {
            "language": "ru",
            "string": "\u041f\u043e\u043a\u0430\u0437\u0430\u0442\u044c \u043c\u0435\u043d\u044f \u0425\u0435\u043c\u0438\u043d\u0433\u0443\u044d\u044f \u0430\u0432\u0442\u043e\u0431\u0438\u043e\u0433\u0440\u0430\u0444\u0438\u044f. ",
            "keywords": "\u0430\u0432\u0442\u043e\u0431\u0438\u043e\u0433\u0440\u0430\u0444\u0438\u044f , \u0425\u0435\u043c\u0438\u043d\u0433\u0443\u044d\u0439  "
        }, {
            "language": "pt",
            "string": "exposi\u00e7\u00e3o mim De Hemingway autobiografia. ",
            "keywords": "autobiografia , Hemingway  "
        }, {
            "language": "en",
            "string": "Show me Hemingway's autobiography.",
            "keywords": "autobiography, Hemingway "
        }, {
            "language": "hi_IN",
            "string": "\u0939\u0947\u092e\u093f\u0902\u0917\u094d\u0935\u0947 \u0915\u0940 \u0906\u0924\u094d\u092e\u0915\u0925\u093e \u092e\u0941\u091d\u0947 \u0926\u093f\u0916\u093e\u092f\u0947\u0902\u0964",
            "keywords": "\u0939\u0947\u092e\u093f\u0902\u0917\u094d\u0935\u0947, \u0906\u0924\u094d\u092e\u0915\u0925\u093e "
        }, {
            "language": "fa",
            "string": "\u062e\u0648\u062f \u0632\u0646\u062f\u06af\u06cc \u0646\u0627\u0645\u0647 \u0647\u0645\u06cc\u0646\u06af\u0648\u06cc \u0631\u0627 \u0628\u062f\u0647.",
            "keywords": "\u062e\u0648\u062f \u0632\u0646\u062f\u06af\u06cc \u0646\u0627\u0645\u0647\u060c \u0647\u0645\u06cc\u0646\u06af\u0648\u06cc "
        }, {
            "language": "it",
            "string": "Mostrami l'autobiografia di Hemingway.",
            "keywords": "autobiorafia, Hemingway "
        }, {
            "language": "fr",
            "string": "Montre l'autobiographie de Hemingway.",
            "keywords": "autobiographie, Hemingway "
        }, {
            "language": "ro",
            "string": "Arat\u0103-mi autobiografia lui Hemingway",
            "keywords": "autobiografie, Hemingway "
        }, {
            "language": "es",
            "string": "Mu\u00e9strame la autobiograf\u00eda Hemingway.",
            "keywords": "autobiograf\u00eda Hemingway "
        }, {
            "language": "nl",
            "string": "Toen de autobiografie van Hemmingway.",
            "keywords": "Hemmingway, autobiografie "
        }],
        "query": {
            "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }"
        },
        "answers": [{
            "head": {
                "vars": ["uri"]
            },
            "results": {
                "bindings": [{
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/A_Moveable_Feast"
                    }
                }]
            }
        }]
    }, {
        "id": "24145",
        "answertype": "resource",
        "aggregation": false,
        "onlydbo": true,
        "hybrid": false,
        "question": [{
            "language": "de",
            "string": "Gib mir alle Sieben Wunder der Antiken Welt.",
            "keywords": "Sieben Wunder der Antiken Welt "
        }, {
            "language": "en",
            "string": "Give me all Seven Wonders of the Ancient World.",
            "keywords": "Seven Wonders of the Ancient World "
        }, {
            "language": "fa",
            "string": "\u0647\u0645\u0647 \u0639\u062c\u0627\u06cc\u0628 \u0647\u0641\u062a\u06af\u0627\u0646\u0647 \u062c\u0647\u0627\u0646 \u0628\u0627\u0633\u062a\u0627\u0646 \u0631\u0627 \u0628\u0647 \u0645\u0646 \u0628\u062f\u0647.",
            "keywords": " \u0639\u062c\u0627\u06cc\u0628 \u0647\u0641\u062a\u06af\u0627\u0646\u0647 \u062f\u0646\u06cc\u0627\u06cc \u0628\u0627\u0633\u062a\u0627\u0646\u0639\u062c\u0627\u06cc\u0628 \u0647\u0641\u062a\u06af\u0627\u0646\u0647 \u062f\u0646\u06cc\u0627\u06cc \u0628\u0627\u0633\u062a\u0627\u0646"
        }, {
            "language": "it",
            "string": "Dammi tutte le Sette Meraviglie del Mondo Antico.",
            "keywords": "Sette Meraviglie del Mondo Antico "
        }, {
            "language": "fr",
            "string": "Donnez-moi le nom des Sept Merveilles du Monde antique.",
            "keywords": "Sept Merveilles du Monde antique "
        }, {
            "language": "ro",
            "string": "D\u0103-mi toate cele \u0219apte minuni ale lumii antice.",
            "keywords": " \u0218apte minuni ale lumii antice"
        }, {
            "language": "es",
            "string": "Dame las Siete Maravillas del Mundo Antiguo.",
            "keywords": " Siete maravillas del mundo antiguo"
        }, {
            "language": "nl",
            "string": "Geef me alle zeven wereldwonderen.",
            "keywords": " Zeven wereldwonderen"
        }],
        "query": {
            "sparql": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }"
        },
        "answers": [{
            "head": {
                "vars": ["uri"]
            },
            "results": {
                "bindings": [{
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Lighthouse_of_Alexandria"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Temple_of_Artemis"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Hanging_Gardens_of_Babylon"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Mausoleum_at_Halicarnassus"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Statue_of_Zeus_at_Olympia"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Seven_Wonders_of_the_Ancient_World"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Colossus_of_Rhodes"
                    }
                }, {
                    "uri": {
                        "type": "uri",
                        "value": "http://dbpedia.org/resource/Great_Pyramid_of_Giza"
                    }
                }]
            }
        }]
    }]
}