{
  "questions": [
    {
      "question": "Give me all actors starring in movies directed by William Shatner.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner . ?x dbo:starring ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/The_People_(film)> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/List_of_TekWar_episodes> <http://dbpedia.org/property/directedby> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Give_In_to_Me> <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Michael_Jackson>",
        "<http://dbpedia.org/resource/William_Shatner> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Wikicat20th-centuryActors>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Notre-Dame-de-Gr\u00e2ce>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/William_Shatner__PersonFunction__1>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/People's_Choice_Awards>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/McGill_University>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Prime_Directive>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Melanie_Shatner>",
        "<http://dbpedia.org/resource/William_Shatner> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Anglophone_Quebec_people>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_William_Shatner>",
        "<http://dbpedia.org/resource/William_Shatner> <http://www.w3.org/2000/01/rdf-schema#label> \"William Shatner\"@en",
        "<http://dbpedia.org/resource/Melanie_Shatner> <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Joel_Gretsch>",
        "<http://dbpedia.org/resource/South_Korea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Seoul>",
        "<http://dbpedia.org/resource/Russian_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Austria-Hungary> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Vienna>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/birthName> \"William Alan Shatner\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/birthName> \"William Alan Shatner\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/birthPlace> \"Notre-Dame-de-Gr\u00e2ce, Montr\u00e9al, Qu\u00e9bec,  Canada\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/ontology/alias> \"Bill Shatner\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/awards> \"Emmy Award\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/almaMater> \"McGill University\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/spouse> \"Nerine Kidd\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/name> \"William Shatner\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/occupation> \"\"@en",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/species> \"no\"@en",
        "<http://dbpedia.org/resource/Notre-Dame-de-Gr\u00e2ce> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Canada>",
        "<http://dbpedia.org/resource/William_Shatner> <http://dbpedia.org/property/honours> \"Officer, Order of Canada\"@en",
        "<http://dbpedia.org/resource/McGill_University> <http://dbpedia.org/property/mascot> \"Marty the Martlet\"@en"
      ]
    },
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/Measure100033615>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/Togo>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Time_in_the_United_Kingdom>",
        "<http://dbpedia.org/resource/Greenwich_Mean_Time> <http://www.w3.org/2000/01/rdf-schema#label> \"Greenwich Mean Time\"@en",
        "<http://dbpedia.org/resource/Togo> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lom\u00e9>",
        "<http://dbpedia.org/resource/Senegal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dakar>",
        "<http://dbpedia.org/resource/Roman_Empire> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>",
        "<http://dbpedia.org/resource/Sierra_Leone> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Freetown>",
        "<http://dbpedia.org/resource/Burkina_Faso> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ouagadougou>",
        "<http://dbpedia.org/resource/Portugal> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Lisbon>",
        "<http://dbpedia.org/resource/Sahrawi_Arab_Democratic_Republic> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Tifariti>",
        "<http://dbpedia.org/resource/Ghana> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Accra>",
        "<http://dbpedia.org/resource/United_Kingdom> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Guinea-Bissau> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bissau>",
        "<http://dbpedia.org/resource/Mali> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Bamako>",
        "<http://dbpedia.org/resource/Guinea> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Conakry>",
        "<http://dbpedia.org/resource/The_Gambia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Banjul>",
        "<http://dbpedia.org/resource/Belgium> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Brussels>",
        "<http://dbpedia.org/resource/Republic_of_Ireland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Dublin>",
        "<http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Ottawa>",
        "<http://dbpedia.org/resource/Liberia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Monrovia>",
        "<http://dbpedia.org/resource/Ivory_Coast> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Abidjan>",
        "<http://dbpedia.org/resource/Mauritania> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nouakchott>",
        "<http://dbpedia.org/resource/Iceland> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Reykjav\u00edk>"
      ]
    },
    {
      "question": "Give me all Seven Wonders of the Ancient World.",
      "query": "PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }",
      "triples": [
        "<http://dbpedia.org/resource/Seven_Network> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.wikidata.org/entity/Q43229>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/wikiPageWikiLink> <http://dbpedia.org/resource/The_Force:_Behind_the_Line>",
        "<http://dbpedia.org/resource/Seven_Network> <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Television_channels_and_stations_established_in_1956>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Eveleigh,_New_South_Wales>",
        "<http://dbpedia.org/resource/Seven_Network> <http://www.w3.org/2000/01/rdf-schema#label> \"Seven Network\"@en",
        "<http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Canberra>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Seven_West_Media>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/headquarters> \"Eveleigh, New South Wales\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/country> <http://dbpedia.org/resource/Australia>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/name> \"Seven Network\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/area> <http://dbpedia.org/resource/HSV_(TV_station)>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/property/language> \"English\"@en",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Seven_West_Media>",
        "<http://dbpedia.org/resource/Seven_West_Media> <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Seven_Group_Holdings>",
        "<http://dbpedia.org/resource/Seven_Network> <http://dbpedia.org/ontology/broadcastNetwork> <http://dbpedia.org/resource/GWN7>"
      ]
    }
  ]
}
