{
  "questions": [
    {
      "question": "Show a list of soccer clubs that play in the Bundesliga.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
      "triples": [
        "<http://dbpedia.org/resource/1974\u201375_FC_Bayern_Munich_season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/1974\u201375_FC_Bayern_Munich_season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2011\u201312_Borussia_Dortmund_season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2011\u201312_Borussia_Dortmund_season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga>",
        "<http://dbpedia.org/resource/2015\u201316_FC_Schalke_04_season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2015\u201316_FC_Schalke_04_season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga>"
      ]
    },
    {
      "question": "Give me the capitals of all countries that the Himalayas run through.",
      "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Pakistan> <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Islamabad>",
        "<http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Pakistan>"
      ]
    },
    {
      "question": "Show me all books in Asimov's Foundation series.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "triples": [
        "<http://dbpedia.org/resource/Foundation's_Edge> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Empire> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Forward_the_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_(Asimov_novel)> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Triumph> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation's_Fear> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Chaos> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/R._Daneel_Olivaw> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/The_Originist> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Foundation_and_Earth> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Second_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>",
        "<http://dbpedia.org/resource/Prelude_to_Foundation> <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series>"
      ]
    },
    {
      "question": "List all boardgames by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Chandragupta_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Fields_of_Fire_(game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Sword_of_Rome> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Washington's_War> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Commands_&_Colors:_Ancients> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Space_Empires_4X> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Twilight_Struggle> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Labyrinth:_The_War_on_Terror,_2001_\u2013_%3F> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Paths_of_Glory_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>"
      ]
    },
    {
      "question": "Give me all actors starring in movies directed by and starring William Shatner.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
      "triples": [
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"Nichelle Nichols\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/James_Doohan>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"DeForest Kelley\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"Walter Koenig\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"George Takei\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"James Doohan\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"Leonard Nimoy\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonard_Nimoy>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/George_Takei>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Nichelle_Nichols>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/property/starring> \"William Shatner\"@en",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/DeForest_Kelley>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Walter_Koenig>"
      ]
    },
    {
      "question": "Give me all Danish films.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }",
      "triples": [
        "<http://dbpedia.org/resource/Klown_Forever> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Klown_Forever> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_King's_Choice> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_King's_Choice> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Sekstet> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Sekstet> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>"
      ]
    },
    {
      "question": "Give me the grandchildren of Bruce Lee.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child dbp:children ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Shannon_Lee> <http://dbpedia.org/property/children> \"1\"",
        "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Shannon_Lee>"
      ]
    },
    {
      "question": "Give me all actors starring in Last Action Hero.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mercedes_Ruehl>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Anthony_Quinn>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Art_Carney>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Frank_McRae>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Noonan>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Austin_O'Brien>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Charles_Dance>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Robert_Prosky>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Arnold_Schwarzenegger>",
        "<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/F._Murray_Abraham>"
      ]
    },
    {
      "question": "Give me the currency of China.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Renminbi>"
      ]
    },
    {
      "question": "Show me Hemingway's autobiography.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
      "triples": [
        "<http://dbpedia.org/resource/A_Moveable_Feast> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Ernest_Hemingway>",
        "<http://dbpedia.org/resource/A_Moveable_Feast> <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Autobiography>"
      ]
    },
    {
      "question": "Give me all Canadian Grunge record labels.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }",
      "triples": [
        "<http://dbpedia.org/resource/Murderecords> <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Grunge>",
        "<http://dbpedia.org/resource/Murderecords> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RecordLabel>",
        "<http://dbpedia.org/resource/Murderecords> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Canada>"
      ]
    },
    {
      "question": "Show me the book that Muhammad Ali wrote.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }",
      "triples": [
        "<http://dbpedia.org/resource/The_Soul_of_a_Butterfly> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Greatest:_My_Own_Story> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Greatest:_My_Own_Story> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali>",
        "<http://dbpedia.org/resource/The_Soul_of_a_Butterfly> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali>"
      ]
    },
    {
      "question": "Give me all books by William Goldman with more than 300 pages.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
      "triples": [
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://dbpedia.org/ontology/numberOfPages> \"485\"",
        "<http://dbpedia.org/resource/Control_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"493\"",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://dbpedia.org/ontology/numberOfPages> \"363\"",
        "<http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://dbpedia.org/ontology/numberOfPages> \"623\"",
        "<http://dbpedia.org/resource/Control_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"305\"",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Brothers_(Goldman_novel)> <http://dbpedia.org/ontology/numberOfPages> \"310\"",
        "<http://dbpedia.org/resource/Marathon_Man_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"309\"",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://dbpedia.org/ontology/numberOfPages> \"355\"",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Boys_and_Girls_Together> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Tinsel_(novel)> <http://dbpedia.org/ontology/numberOfPages> \"342\"",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Hype_and_Glory> <http://dbpedia.org/ontology/numberOfPages> \"306\"",
        "<http://dbpedia.org/resource/Wait_Till_Next_Year> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Control_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman>",
        "<http://dbpedia.org/resource/The_Princess_Bride_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/The_Color_of_Light> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>"
      ]
    },
    {
      "question": "Give me the birth place of Frank Sinatra.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
      "triples": [
        "<http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Hoboken,_New_Jersey>"
      ]
    },
    {
      "question": "List all episodes of the first season of the HBO television series The Sopranos.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbp:series res:The_Sopranos ; dbp:season 1 }",
      "triples": [
        "<http://dbpedia.org/resource/Nobody_Knows_Anything> dbp:series <http://dbpedia.org/resource/The_Sopranos>",
        "<http://dbpedia.org/resource/Nobody_Knows_Anything> dbp:season 1",
        "<http://dbpedia.org/resource/Meadowlands_(The_Sopranos)> dbp:season 1",
        "<http://dbpedia.org/resource/Meadowlands_(The_Sopranos)> dbp:series <http://dbpedia.org/resource/The_Sopranos>",
        "<http://dbpedia.org/resource/College_(The_Sopranos)> dbp:series <http://dbpedia.org/resource/The_Sopranos>",
        "<http://dbpedia.org/resource/College_(The_Sopranos)> dbp:season 1"
      ]
    },
    {
      "question": "Give me the Apollo 14 astronauts.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
      "triples": [
        "<http://dbpedia.org/resource/Alan_Shepard> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>",
        "<http://dbpedia.org/resource/Edgar_Mitchell> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>",
        "<http://dbpedia.org/resource/Stuart_Roosa> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>"
      ]
    },
    {
      "question": "Give me a list of all trumpet players that were bandleaders.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
      "triples": [
        "<http://dbpedia.org/resource/Abatte_Barihun> <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet>",
        "<http://dbpedia.org/resource/Abatte_Barihun> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader>",
        "<http://dbpedia.org/resource/Alan_Silva> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader>",
        "<http://dbpedia.org/resource/Alan_Silva> <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet>",
        "<http://dbpedia.org/resource/Richard_Maltby_Sr.> <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet>",
        "<http://dbpedia.org/resource/Richard_Maltby_Sr.> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader>"
      ]
    },
    {
      "question": "Give me all movies directed by Francis Ford Coppola.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
      "triples": [
        "<http://dbpedia.org/resource/The_Godfather> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola>",
        "<http://dbpedia.org/resource/The_Godfather> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Supernova_(2000_film)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Supernova_(2000_film)> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola>",
        "<http://dbpedia.org/resource/Tetro> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola>",
        "<http://dbpedia.org/resource/Tetro> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>"
      ]
    },
    {
      "question": "Give me all launch pads operated by NASA.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
      "triples": [
        "<http://dbpedia.org/resource/Cape_Canaveral_Space_Launch_Complex_17> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Space_Launch_Complex_17> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_13> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39B> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_45> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_47> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Keweenaw_Rocket_Range> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_45> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_36> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Broglio_Space_Center> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_13> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39B> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Broglio_Space_Center> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_36> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_18> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_47> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_48> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39A> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Cape_Canaveral_Launch_Complex_18> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Keweenaw_Rocket_Range> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_48> <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39A> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>",
        "<http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad>"
      ]
    },
    {
      "question": "List all the musicals with music by Elton John.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
      "triples": [
        "<http://dbpedia.org/resource/Lestat_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/Billy_Elliot_the_Musical> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/The_Lion_King_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Aida_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>",
        "<http://dbpedia.org/resource/Aida_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Billy_Elliot_the_Musical> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Lestat_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/The_Lion_King_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>"
      ]
    },
    {
      "question": "Give me the runtime of Toy Story.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "triples": [
        "<http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> \"4860.0\""
      ]
    },
    {
      "question": "List the children of Margaret Thatcher.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Mark_Thatcher>",
        "<http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Carol_Thatcher>"
      ]
    },
    {
      "question": "Give me all actors starring in movies directed by William Shatner.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner . ?x dbo:starring ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/James_Doohan>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonard_Nimoy>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/George_Takei>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Nichelle_Nichols>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/DeForest_Kelley>",
        "<http://dbpedia.org/resource/Star_Trek_V:_The_Final_Frontier> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Walter_Koenig>"
      ]
    }
  ]
}
