{
  "questions": [
    {
      "question": "List all games by GMT.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "triples": [
        "<http://dbpedia.org/resource/Chandragupta_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Fields_of_Fire_(game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Sword_of_Rome> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Washington's_War> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Commands_&_Colors:_Ancients> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Labyrinth:_The_War_on_Terror,_2001_\u2013_%3F> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Twilight_Struggle> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Space_Empires_4X> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>",
        "<http://dbpedia.org/resource/Paths_of_Glory_(board_game)> <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games>"
      ]
    },
    {
      "question": "Give me all video games published by Mean Hamster Software.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Mean_Hamster_Software dbo:product ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Exidy>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Myst>",
        "<http://dbpedia.org/resource/Mean_Hamster_Software> <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Riven>"
      ]
    },
    {
      "question": "Give me all members of Prodigy.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
      "triples": [
        "<http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Liam_Howlett>",
        "<http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Maxim_(musician)>"
      ]
    },
    {
      "question": "Show me all museums in London.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
      "triples": [
        "<http://dbpedia.org/resource/Postal_Museum,_London> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum>",
        "<http://dbpedia.org/resource/Postal_Museum,_London> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Museum_of_Homelessness> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum>",
        "<http://dbpedia.org/resource/Museum_of_Homelessness> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London>",
        "<http://dbpedia.org/resource/Jack_the_Ripper_Museum> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum>",
        "<http://dbpedia.org/resource/Jack_the_Ripper_Museum> <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London>"
      ]
    },
    {
      "question": "Give me all writers that won the Nobel Prize in literature.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }",
      "triples": [
        "<http://dbpedia.org/resource/Czes\u0142aw_Mi\u0142osz> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature>",
        "<http://dbpedia.org/resource/Czes\u0142aw_Mi\u0142osz> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>",
        "<http://dbpedia.org/resource/Louise_Gl\u00fcck> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>",
        "<http://dbpedia.org/resource/Louise_Gl\u00fcck> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature>",
        "<http://dbpedia.org/resource/Harold_Pinter> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature>",
        "<http://dbpedia.org/resource/Harold_Pinter> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>"
      ]
    },
    {
      "question": "Show me all basketball players that are higher than 2 meters.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }",
      "triples": [
        "<http://dbpedia.org/resource/Wally_Anderzunas> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>",
        "<http://dbpedia.org/resource/Wally_Anderzunas> <http://dbpedia.org/ontology/height> \"2.0066\"",
        "<http://dbpedia.org/resource/Zhai_Xiaochuan> <http://dbpedia.org/ontology/height> \"2.0447\"",
        "<http://dbpedia.org/resource/Zhai_Xiaochuan> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>",
        "<http://dbpedia.org/resource/Greg_Stokes> <http://dbpedia.org/ontology/height> \"2.0828\"",
        "<http://dbpedia.org/resource/Greg_Stokes> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>"
      ]
    },
    {
      "question": "Give all swimmers that were born in Moscow.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
      "triples": [
        "<http://dbpedia.org/resource/Yevhen_Mykhailov> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Yevhen_Mykhailov> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Swimmer>",
        "<http://dbpedia.org/resource/Nikolay_Suhorukov> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Swimmer>",
        "<http://dbpedia.org/resource/Nikolay_Suhorukov> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Alexandra_Patskevich> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow>",
        "<http://dbpedia.org/resource/Alexandra_Patskevich> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Swimmer>"
      ]
    },
    {
      "question": "Give me all Danish movies.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
      "triples": [
        "<http://dbpedia.org/resource/Klown_Forever> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Klown_Forever> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_King's_Choice> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_King's_Choice> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Sekstet> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Sekstet> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>"
      ]
    },
    {
      "question": "Give me all islands that belong to Japan.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
      "triples": [
        "<http://dbpedia.org/resource/Sakishima_Islands> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>",
        "<http://dbpedia.org/resource/Sakishima_Islands> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan>",
        "<http://dbpedia.org/resource/Udone-shima> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>",
        "<http://dbpedia.org/resource/Udone-shima> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan>",
        "<http://dbpedia.org/resource/Akusekijima> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan>",
        "<http://dbpedia.org/resource/Akusekijima> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>"
      ]
    },
    {
      "question": "Give me all Apollo 14 astronauts.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
      "triples": [
        "<http://dbpedia.org/resource/Alan_Shepard> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>",
        "<http://dbpedia.org/resource/Edgar_Mitchell> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>",
        "<http://dbpedia.org/resource/Stuart_Roosa> <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>"
      ]
    },
    {
      "question": "Give me all soccer clubs in the Premier League.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
      "triples": [
        "<http://dbpedia.org/resource/2011\u201312_Arsenal_F.C._season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2011\u201312_Arsenal_F.C._season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League>",
        "<http://dbpedia.org/resource/2014\u201315_Chelsea_F.C._season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2014\u201315_Chelsea_F.C._season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League>",
        "<http://dbpedia.org/resource/2009\u201310_Burnley_F.C._season> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>",
        "<http://dbpedia.org/resource/2009\u201310_Burnley_F.C._season> <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League>"
      ]
    },
    {
      "question": "Give me all ESA astronauts.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
      "triples": [
        "<http://dbpedia.org/resource/Andreas_Mogensen> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>",
        "<http://dbpedia.org/resource/Christer_Fuglesang> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency>",
        "<http://dbpedia.org/resource/Dirk_Frimout> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>",
        "<http://dbpedia.org/resource/Thomas_Reiter> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency>",
        "<http://dbpedia.org/resource/Christer_Fuglesang> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>",
        "<http://dbpedia.org/resource/Thomas_Reiter> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>",
        "<http://dbpedia.org/resource/Dirk_Frimout> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency>",
        "<http://dbpedia.org/resource/Andreas_Mogensen> <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency>"
      ]
    },
    {
      "question": "Give me all films produced by Hal Roach.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }",
      "triples": [
        "<http://dbpedia.org/resource/The_Mysterious_Mystery!> <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach>",
        "<http://dbpedia.org/resource/The_Mysterious_Mystery!> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Our_Relations> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Our_Relations> <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach>",
        "<http://dbpedia.org/resource/Dirty_Work_(1933_film)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Dirty_Work_(1933_film)> <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach>"
      ]
    },
    {
      "question": "Give me all movies with Tom Cruise.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
      "triples": [
        "<http://dbpedia.org/resource/Mission:_Impossible_2> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/Mission:_Impossible_2> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise>",
        "<http://dbpedia.org/resource/Losin'_It> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise>",
        "<http://dbpedia.org/resource/Losin'_It> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_Last_Samurai> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>",
        "<http://dbpedia.org/resource/The_Last_Samurai> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise>"
      ]
    },
    {
      "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:subdivision res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
      "triples": [
        "<http://dbpedia.org/resource/Elizabeth,_New_Jersey> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>",
        "<http://dbpedia.org/resource/Jersey_City,_New_Jersey> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>",
        "<http://dbpedia.org/resource/Paterson,_New_Jersey> <http://dbpedia.org/ontology/subdivision> <http://dbpedia.org/resource/New_Jersey>",
        "<http://dbpedia.org/resource/Newark,_New_Jersey> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>",
        "<http://dbpedia.org/resource/Newark,_New_Jersey> <http://dbpedia.org/ontology/populationTotal> \"311549\"",
        "<http://dbpedia.org/resource/Jersey_City,_New_Jersey> <http://dbpedia.org/ontology/populationTotal> \"292449\"",
        "<http://dbpedia.org/resource/Jersey_City,_New_Jersey> <http://dbpedia.org/ontology/subdivision> <http://dbpedia.org/resource/New_Jersey>",
        "<http://dbpedia.org/resource/Paterson,_New_Jersey> <http://dbpedia.org/ontology/populationTotal> \"159732\"",
        "<http://dbpedia.org/resource/Elizabeth,_New_Jersey> <http://dbpedia.org/ontology/populationTotal> \"137298\"",
        "<http://dbpedia.org/resource/Elizabeth,_New_Jersey> <http://dbpedia.org/ontology/subdivision> <http://dbpedia.org/resource/New_Jersey>",
        "<http://dbpedia.org/resource/Newark,_New_Jersey> <http://dbpedia.org/ontology/subdivision> <http://dbpedia.org/resource/New_Jersey>",
        "<http://dbpedia.org/resource/Paterson,_New_Jersey> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>"
      ]
    },
    {
      "question": "List the seven kings of Rome.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
      "triples": [
        "<http://dbpedia.org/resource/Romulus> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Numa_Pompilius> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Lucius_Tarquinius_Superbus> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Servius_Tullius> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Ancus_Marcius> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Lucius_Tarquinius_Priscus> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>",
        "<http://dbpedia.org/resource/Tullus_Hostilius> <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome>"
      ]
    },
    {
      "question": "Give me all people that were born in Vienna and died in Berlin.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
      "triples": [
        "<http://dbpedia.org/resource/Jacob_Taubes> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Jacob_Taubes> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna>",
        "<http://dbpedia.org/resource/Mathilde_Danegger> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Mathilde_Danegger> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna>",
        "<http://dbpedia.org/resource/Carl_Stephenson_(author)> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna>",
        "<http://dbpedia.org/resource/Carl_Stephenson_(author)> <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin>"
      ]
    },
    {
      "question": "Is Darth Vader Luke\u2019s father?",
      "query": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> }",
      "triples": [
        "<http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker>"
      ]
    },
    {
      "question": "Give me all breeds of the German Shepherd dog.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
      "triples": [
        "<http://dbpedia.org/resource/Lucky_(war_dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Ace_the_Wonder_Dog> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Major_(Joe_Biden's_dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Rifleman_Khan> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Crumstone_Irma> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Major_(Franklin_D._Roosevelt's_dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Horand_von_Grafrath> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Finn_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Thunder_the_Dog> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Blondi> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Jet_of_Iada> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Nemo_A534> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Appollo_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Antis_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Commander_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Lightning_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Mancs_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Strongheart> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Lucca_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Trakr> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>",
        "<http://dbpedia.org/resource/Champ_(dog)> <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd>"
      ]
    },
    {
      "question": "Is Cola a beverage?",
      "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "triples": [
        "<http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>"
      ]
    },
    {
      "question": "Give me all actors who were born in Berlin.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
      "triples": [
        "<http://dbpedia.org/resource/Walter_Bluhm> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin>",
        "<http://dbpedia.org/resource/Walter_Bluhm> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor>"
      ]
    },
    {
      "question": "Give me all Swedish holidays.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
      "triples": [
        "<http://dbpedia.org/resource/International_Men's_Day> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Sweden_Finns'_Day> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Cinnamon_Roll_Day> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Gustavus_Adolphus_Day> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Victoria_Days> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/International_Men's_Day> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Gustavus_Adolphus_Day> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Victoria_Days> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Saint_Knut's_Day> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Sweden_Finns'_Day> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Veterans_Day_(Sweden)> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Veterans_Day_(Sweden)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Saint_Knut's_Day> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Knut's_party> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Black_Friday_(shopping)> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>",
        "<http://dbpedia.org/resource/Knut's_party> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Cinnamon_Roll_Day> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>",
        "<http://dbpedia.org/resource/Black_Friday_(shopping)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday>"
      ]
    },
    {
      "question": "List all the musicals with music by Leonard Bernstein.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
      "triples": [
        "<http://dbpedia.org/resource/West_Side_Story> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Wonderful_Town> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/The_Race_to_Urga> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Candide_(operetta)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Side_by_Side_by_Sondheim> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/On_the_Town_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/Side_by_Side_by_Sondheim> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/West_Side_Story> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Candide_(operetta)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>",
        "<http://dbpedia.org/resource/The_Race_to_Urga> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/On_the_Town_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>",
        "<http://dbpedia.org/resource/Wonderful_Town> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>"
      ]
    },
    {
      "question": "Give me all types of eating disorders.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
      "triples": [
        "<http://dbpedia.org/resource/Orthorexia_nervosa> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>",
        "<http://dbpedia.org/resource/Killing_Aurora> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>",
        "<http://dbpedia.org/resource/Ingestive_behaviors> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>",
        "<http://dbpedia.org/resource/Pagophagy> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>",
        "<http://dbpedia.org/resource/Hypergymnasia> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>",
        "<http://dbpedia.org/resource/Drunkorexia> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/WikicatEatingDisorders>"
      ]
    },
    {
      "question": "Give me all books written by Danielle Steel.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
      "triples": [
        "<http://dbpedia.org/resource/Matters_of_the_Heart_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Matters_of_the_Heart_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel>",
        "<http://dbpedia.org/resource/One_Day_at_a_Time_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel>",
        "<http://dbpedia.org/resource/One_Day_at_a_Time_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>",
        "<http://dbpedia.org/resource/Family_Album_(novel)> <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel>",
        "<http://dbpedia.org/resource/Family_Album_(novel)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>"
      ]
    }
  ]
}
