{
  "questions": [
    {
      "question": "Give me all libraries established earlier than 1400.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }",
      "triples": [
        "<http://dbpedia.org/resource/Heidelberg_University_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Austrian_National_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Merton_College_Library> <http://dbpedia.org/property/established> \"1373\"",
        "<http://dbpedia.org/resource/Library_of_Pergamum> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Mother_Irene_Gill_Memorial_Library> <http://dbpedia.org/property/established> \"20\"",
        "<http://dbpedia.org/resource/Austrian_National_Library> <http://dbpedia.org/property/established> \"1368\"",
        "<http://dbpedia.org/resource/Library_of_Pergamum> <http://dbpedia.org/property/established> \"3\"",
        "<http://dbpedia.org/resource/Bolton_Library> <http://dbpedia.org/property/established> \"18\"",
        "<http://dbpedia.org/resource/Heidelberg_University_Library> <http://dbpedia.org/property/established> \"1388\"",
        "<http://dbpedia.org/resource/Library_of_Ashurbanipal> <http://dbpedia.org/property/established> \"7\"",
        "<http://dbpedia.org/resource/Merton_College_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Ningbo_University_Zone_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Saraswathi_Mahal_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Library_of_Ashurbanipal> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Bolton_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Ningbo_University_Zone_Library> <http://dbpedia.org/property/established> \"28\"",
        "<http://dbpedia.org/resource/Maughan_Library> <http://dbpedia.org/property/established> \"1377\"",
        "<http://dbpedia.org/resource/Saraswathi_Mahal_Library> <http://dbpedia.org/property/established> \"16\"",
        "<http://dbpedia.org/resource/Maughan_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>",
        "<http://dbpedia.org/resource/Maughan_Library> <http://dbpedia.org/property/established> \"1232\"",
        "<http://dbpedia.org/resource/Mother_Irene_Gill_Memorial_Library> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library>"
      ]
    },
    {
      "question": "Give me all Methodist politicians.",
      "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
      "triples": [
        "<http://dbpedia.org/resource/Ryan_Kiesel> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>",
        "<http://dbpedia.org/resource/Luther_H._Hodges> <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>",
        "<http://dbpedia.org/resource/A._J._W._McNeilly> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>",
        "<http://dbpedia.org/resource/Luther_H._Hodges> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>",
        "<http://dbpedia.org/resource/Walter_B._Grieve> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>",
        "<http://dbpedia.org/resource/A._J._W._McNeilly> <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>",
        "<http://dbpedia.org/resource/James_Patrick_Fox> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>",
        "<http://dbpedia.org/resource/Walter_B._Grieve> <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>",
        "<http://dbpedia.org/resource/Ryan_Kiesel> <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>",
        "<http://dbpedia.org/resource/James_Patrick_Fox> <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>"
      ]
    },
    {
      "question": "Give me all actors called Baldwin.",
      "query": "PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?uri dbp:name ?name FILTER regex(?name, \"Baldwin\"). ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> }",
      "triples": [
        "<http://dbpedia.org/resource/A._Michael_Baldwin> <http://dbpedia.org/property/name> \"A. Michael Baldwin\"@en",
        "<http://dbpedia.org/resource/A._Michael_Baldwin> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor>",
        "<http://dbpedia.org/resource/Judith_Baldwin> <http://dbpedia.org/property/name> \"Judith Baldwin\"@en",
        "<http://dbpedia.org/resource/Judith_Baldwin> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor>",
        "<http://dbpedia.org/resource/Peter_Baldwin_(actor)> <http://dbpedia.org/property/name> \"Peter Baldwin\"@en",
        "<http://dbpedia.org/resource/Peter_Baldwin_(actor)> <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor>"
      ]
    },
    {
      "question": "Give me the birthdays of all actors of the television show Charmed.",
      "query": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
      "triples": [
        "<http://dbpedia.org/resource/Brian_Krause> <http://dbpedia.org/ontology/birthDate> \"1969-02-01\"",
        "<http://dbpedia.org/resource/Holly_Marie_Combs> <http://dbpedia.org/ontology/birthDate> \"1973-12-03\"",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Greg_Vaughan>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julian_McMahon>",
        "<http://dbpedia.org/resource/Julian_McMahon> <http://dbpedia.org/ontology/birthDate> \"1968-07-27\"",
        "<http://dbpedia.org/resource/Kaley_Cuoco> <http://dbpedia.org/ontology/birthDate> \"1985-11-30\"",
        "<http://dbpedia.org/resource/Greg_Vaughan> <http://dbpedia.org/ontology/birthDate> \"1973-06-15\"",
        "<http://dbpedia.org/resource/Shannen_Doherty> <http://dbpedia.org/ontology/birthDate> \"1971-04-12\"",
        "<http://dbpedia.org/resource/Ted_King_(actor)> <http://dbpedia.org/ontology/birthDate> \"1965-10-01\"",
        "<http://dbpedia.org/resource/Drew_Fuller> <http://dbpedia.org/ontology/birthDate> \"1980-05-19\"",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Shannen_Doherty>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Kaley_Cuoco>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Ted_King_(actor)>",
        "<http://dbpedia.org/resource/Alyssa_Milano> <http://dbpedia.org/ontology/birthDate> \"1972-12-19\"",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Alyssa_Milano>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Dorian_Gregory>",
        "<http://dbpedia.org/resource/Dorian_Gregory> <http://dbpedia.org/ontology/birthDate> \"1971-01-26\"",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Rose_McGowan>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Brian_Krause>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Drew_Fuller>",
        "<http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Holly_Marie_Combs>",
        "<http://dbpedia.org/resource/Rose_McGowan> <http://dbpedia.org/ontology/birthDate> \"1973-09-05\""
      ]
    },
    {
      "question": "Give me a list of all lakes in Denmark.",
      "query": "SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }",
      "triples": [
        "<http://dbpedia.org/resource/Arres\u00f8> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/B\u00f8lling_Lake> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Skagerrak> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Baltic_Sea> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Norwegian_Sea> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/North_Sea> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/North_Sea> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Arres\u00f8> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Norwegian_Sea> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>",
        "<http://dbpedia.org/resource/Baltic_Sea> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Fures\u00f8_(lake)> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/B\u00f8lling_Lake> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Skagerrak> <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>",
        "<http://dbpedia.org/resource/Fures\u00f8_(lake)> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake>"
      ]
    }
  ]
}
